{"sentText": "Serbia (, ; Serbian: , , ), officially the Republic of Serbia (Serbian: , , ), is a landlocked country in Southeastern and Central Europe, situated at the crossroads of the Pannonian Plain and the Balkans. It shares land borders with Hungary to the north, Romania to the northeast, Bulgaria to the southeast, North Macedonia to the south, Croatia and Bosnia and Herzegovina to the west, and Montenegro to the southwest, and claiming a border with Albania through the disputed territory of Kosovo. Serbia with Kosovo has about 8.6 million inhabitants. Its capital Belgrade is also the largest city.", "relationMentions": [{"em1Text": "Belgrade", "em2Text": "Serbia", "label": "is_capital_of"}, {"em1Text": "Belgrade", "em2Text": "Serbia", "label": "is_largest_city_of"}, {"em1Text": "Serbia", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Serbia", "em2Text": "Hungary", "label": "borders"}, {"em1Text": "Serbia", "em2Text": "Romania", "label": "borders"}, {"em1Text": "Serbia", "em2Text": "Bulgaria", "label": "borders"}, {"em1Text": "Serbia", "em2Text": "North Macedonia", "label": "borders"}, {"em1Text": "Serbia", "em2Text": "Croatia", "label": "borders"}, {"em1Text": "Serbia", "em2Text": "Bosnia and Herzegovina", "label": "borders"}, {"em1Text": "Serbia", "em2Text": "Montenegro", "label": "borders"}, {"em1Text": "Serbia", "em2Text": "Albania", "label": "borders"}]}
{"sentText": "The official currency of Serbia is Serbian dinar (ISO code: RSD), and the central bank is National Bank of Serbia.", "relationMentions": [{"em1Text": "Serbia", "em2Text": "Serbian dinar", "label": "currency_is"}]}
{"sentText": "The climate of Serbia is under the influences of the landmass of Eurasia and the Atlantic Ocean and Mediterranean Sea. With mean January temperatures around , and mean July temperatures of , it can be classified as a warm-humid continental or humid subtropical climate. In the north, the climate is more continental, with cold winters, and hot, humid summers along with well-distributed rainfall patterns.", "relationMentions": [{"em1Text": "Serbia", "em2Text": "warm-humid continental", "label": "has_climate"}, {"em1Text": "Serbia", "em2Text": "humid subtropical climate", "label": "has_climate"}, {"em1Text": "Serbia", "em2Text": "continental", "label": "has_climate"}]}
{"sentText": "The Constitution of Serbia defines it as a secular state with guaranteed religious freedom. Orthodox Christians with 6,079,396 comprise 84.", "relationMentions": [{"em1Text": "Serbia", "em2Text": "Orthodox Christians", "label": "majority_religion_is"}]}
{"sentText": "The official language in Serbia is Serbian, native to 88% of the population.", "relationMentions": [{"em1Text": "Serbia", "em2Text": "Serbian", "label": "official_language_is"}]}
{"sentText": "Slovenia ( ; ), officially the Republic of Slovenia (Slovene: , abbr.: \"RS\"), is a country in Central Europe. It is bordered by Italy to the west, Austria to the north, Hungary to the northeast, Croatia to the southeast, and the Adriatic Sea to the southwest. Slovenia is mostly mountainous and forested, covers , and has a population of 2.1 million (2,108,708 people). Slovenes constitute over 80% of the country's population. Slovene, a South Slavic language, is the official language. Slovenia has a predominantly continental climate, with the exception of the Slovene Littoral and the Julian Alps. A sub-mediterranean climate reaches to the northern extensions of the Dinaric Alps that traverse the country in a northwest-southeast direction. The Julian Alps in the northwest have an alpine climate. Continental climate is more pronounced towards the northeastern Pannonian Plain. The capital and largest city--Ljubljana--is nearly the centre of the country.", "relationMentions": [{"em1Text": "Slovenia", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Slovenia", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Slovenia", "em2Text": "Italy", "label": "borders"}, {"em1Text": "Slovenia", "em2Text": "Austria", "label": "borders"}, {"em1Text": "Slovenia", "em2Text": "Hungary", "label": "borders"}, {"em1Text": "Slovenia", "em2Text": "Croatia", "label": "borders"}, {"em1Text": "Ljubljana", "em2Text": "Slovenia", "label": "is_capital_of"}, {"em1Text": "Ljubljana", "em2Text": "Slovenia", "label": "is_largest_city_of"}, {"em1Text": "Slovenia", "em2Text": "continental climate", "label": "has_climate"}, {"em1Text": "Slovenia", "em2Text": "sub-mediterranean climate", "label": "has_climate"}, {"em1Text": "Slovenia", "em2Text": "alpine climate", "label": "has_climate"}]}
{"sentText": "The official language in Slovenia is Slovene, which is a member of the South Slavic language group.", "relationMentions": [{"em1Text": "Slovenia", "em2Text": "Slovene", "label": "official_language_is"}]}
{"sentText": "Slovenia was in the beginning of 2007 the first new member to introduce the euro as its currency, replacing the tolar.", "relationMentions": [{"em1Text": "Slovenia", "em2Text": "euro", "label": "currency_is"}]}
{"sentText": "After 1990, the Catholic Church regained some of its former influence, but Slovenia remains a largely secularized society. According to the 2002 census, 57.8% of the population is Catholic. In 1991, 71.6% were self-declared Catholics which means a drop of more than 1% annually. The vast majority of Slovenian Catholics belong to the Latin Rite. A small number of Greek Catholics live in the White Carniola region.\nThe 2018 Eurobarometer data shows 73.4% of population identifying as Catholic that fell to 72.", "relationMentions": [{"em1Text": "Slovenia", "em2Text": "Catholic", "label": "majority_religion_is"}]}
{"sentText": "Slovakia (; ), officially the Slovak Republic ( ), is a landlocked country in Central Europe. It is bordered by Poland to the north, Ukraine to the east, Hungary to the south, Austria to the southwest, and the Czech Republic to the northwest. Slovakia's mostly mountainous territory spans about , with a population of over 5.4 million. The capital and largest city is Bratislava, while the second largest city is Kosice.", "relationMentions": [{"em1Text": "Slovakia", "em2Text": "Poland", "label": "borders"}, {"em1Text": "Slovakia", "em2Text": "Ukraine", "label": "borders"}, {"em1Text": "Slovakia", "em2Text": "Hungary", "label": "borders"}, {"em1Text": "Slovakia", "em2Text": "Austria", "label": "borders"}, {"em1Text": "Slovakia", "em2Text": "Czech", "label": "borders"}, {"em1Text": "Bratislava", "em2Text": "Slovakia", "label": "is_capital_of"}, {"em1Text": "Bratislava", "em2Text": "Slovakia", "label": "is_largest_city_of"}, {"em1Text": "Slovakia", "em2Text": "Republic", "label": "has_state_type"}]}
{"sentText": "The Slovak climate lies between the temperate and continental climate zones with relatively warm summers and cold, cloudy and humid winters.", "relationMentions": [{"em1Text": "Slovak", "em2Text": "temperate", "label": "has_climate"}, {"em1Text": "Slovak", "em2Text": "continental", "label": "has_climate"}]}
{"sentText": "On 1 January 2009, Slovakia adopted the Euro as its national currency.", "relationMentions": [{"em1Text": "Slovakia", "em2Text": "Euro", "label": "currency_is"}]}
{"sentText": "The Slovak constitution guarantees freedom of religion. In 2021, 55.8% of population identified themselves as Roman Catholics, 5.", "relationMentions": []}
{"sentText": "Slovakia will be obliged to set state budget inclusive ESA funding. Slovakia was ranked 33rd in the Global Innovation Index in 2021.\nDemographics.\nThe population is over 5.4 million and consists mostly of Slovaks. The average population density is 110 inhabitants per km2. According to the 2021 census, the majority of the inhabitants of Slovakia are Slovaks (83.82%). Hungarians are the largest ethnic minority (7.75%). Other ethnic groups include Roma (1.23%), Czechs (0.53%), Rusyns (0.44%) and others or unspecified (6.1%).\nIn 2018 the median age of the Slovak population was 41 years.\nThe largest waves of Slovak emigration occurred in the 19th and early 20th centuries. In the 1990 US census, 1.8 million people self-identified as having Slovak ancestry.\nLanguages.\nThe official language is Slovak, a member of the Slavic language family.", "relationMentions": [{"em1Text": "Slovakia", "em2Text": "Slovak", "label": "official_language_is"}]}
{"sentText": "Switzerland, officially the Swiss Confederation, is a landlocked country at the confluence of Western, Central and Southern Europe. The country is a federal republic composed of 26 cantons, with federal authorities based in Bern. Switzerland is bordered by Italy to the south, France to the west, Germany to the north and Austria and Liechtenstein to the east. It is geographically divided among the Swiss Plateau, the Alps and the Jura, spanning a total area of and land area of . Although the Alps occupy the greater part of the territory, the Swiss population of approximately 8.5 million is concentrated mostly on the plateau, where the largest cities and economic centres are, among them Zurich, Geneva and Basel.", "relationMentions": [{"em1Text": "Switzerland", "em2Text": "Italy", "label": "borders"}, {"em1Text": "Switzerland", "em2Text": "France", "label": "borders"}, {"em1Text": "Switzerland", "em2Text": "Germany", "label": "borders"}, {"em1Text": "Switzerland", "em2Text": "Austria", "label": "borders"}, {"em1Text": "Switzerland", "em2Text": "Liechtenstein", "label": "borders"}, {"em1Text": "Zurich", "em2Text": "Switzerland", "label": "is_largest_city_of"}, {"em1Text": "Geneva", "em2Text": "Switzerland", "label": "is_largest_city_of"}, {"em1Text": "Basel", "em2Text": "Switzerland", "label": "is_largest_city_of"}]}
{"sentText": "The Swiss climate is generally temperate, but can vary greatly between the localities, from glacial conditions on the mountaintops to the often pleasant near Mediterranean climate at Switzerland's southern tip.", "relationMentions": [{"em1Text": "temperate", "em2Text": "Swiss", "label": "has_climate"}, {"em1Text": "Swiss", "em2Text": "Mediterranean climate", "label": "has_climate"}]}
{"sentText": "This new constitution also brought a legal end to nobility in Switzerland.\nA system of single weights and measures was introduced, and in 1850 the Swiss franc became the Swiss single currency, complemented by the WIR franc in 1934.", "relationMentions": []}
{"sentText": "Turkey ( ), officially the Republic of Turkiye ( ), is a transcontinental country located mainly on the Anatolian Peninsula in Western Asia, with a small portion on the Balkan Peninsula in Southeast Europe. It shares borders with the Black Sea to the north; Georgia to the northeast; Armenia, Azerbaijan, and Iran to the east; Iraq to the southeast; Syria and the Mediterranean Sea to the south; the Aegean Sea to the west; and Greece and Bulgaria to the northwest. Cyprus is located off the south coast.", "relationMentions": [{"em1Text": "Georgia", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Cyprus", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Armenia", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Azerbaijan", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Iran", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Iraq", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Syria", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Greece", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Bulgaria", "em2Text": "Turkey", "label": "borders"}]}
{"sentText": "Ankara is Turkey's capital, while Istanbul is its largest city and financial centre.", "relationMentions": [{"em1Text": "Ankara", "em2Text": "Turkey", "label": "is_capital_of"}, {"em1Text": "Istanbul", "em2Text": "Turkey", "label": "is_largest_city_of"}]}
{"sentText": "The coastal areas of Turkey bordering the Aegean and Mediterranean Seas have a temperate Mediterranean climate, with hot, dry summers and mild to cool, wet winters. The coastal areas bordering the Black Sea have a temperate oceanic climate with warm, wet summers and cool to cold, wet winters. The Turkish Black Sea coast receives the most precipitation and is the only region of Turkey that receives high precipitation throughout the year. The eastern part of the Black Sea coast averages annually which is the highest precipitation in the country. The coastal areas bordering the Sea of Marmara, which connects the Aegean Sea and the Black Sea, have a transitional climate between a temperate Mediterranean climate and a temperate oceanic climate with warm to hot, moderately dry summers and cool to cold, wet winters. Snow falls on the coastal areas of the Sea of Marmara and the Black Sea almost every winter, but usually melts in no more than a few days. However, snow is rare in the coastal areas of the Aegean Sea and very rare in the coastal areas of the Mediterranean Sea. Winters on the Anatolian plateau are especially severe. Temperatures of -30 degC to -40 degC (-22 degF to -40 degF) do occur in northeastern Anatolia, and snow may lie on the ground for at least 120 days of the year, and during the entire year on the summits of the highest mountains. In central Anatolia the temperatures can drop below -20 degC ( -4 degF) with the mountains being even colder.\nMountains close to the coast prevent Mediterranean influences from extending inland, giving the central Anatolian plateau of the interior of Turkey a continental climate with sharply contrasting seasons.", "relationMentions": [{"em1Text": "Turkey", "em2Text": "temperate Mediterranean climate", "label": "has_climate"}, {"em1Text": "Turkey", "em2Text": "temperate oceanic climate", "label": "has_climate"}, {"em1Text": "Turkey", "em2Text": "transitional climate", "label": "has_climate"}, {"em1Text": "Turkey", "em2Text": "continental climate", "label": "has_climate"}]}
{"sentText": "Turkey is a presidential republic within a multi-party system.", "relationMentions": [{"em1Text": "Turkey", "em2Text": "presidential republic", "label": "has_state_type"}]}
{"sentText": "A 2016 survey by Ipsos, interviewing 17,180 adults across 22 countries, found that Islam was the dominant religion in Turkey, adhered to by 82% of the total population; religiously unaffiliated people comprised 13% of the population, while 2% were Christians.", "relationMentions": [{"em1Text": "Turkey", "em2Text": "Islam", "label": "majority_religion_is"}]}
{"sentText": "According to the \"Address-Based Population Recording System\" of Turkey, the country's population was 74.7 million people in 2011, nearly three-quarters of whom lived in towns and cities.", "relationMentions": [{"em1Text": "Turkey", "em2Text": "74.7 million people", "label": "has_population_of"}]}
{"sentText": "Turkey hosts the largest number of refugees in the world, including 3.6 million Syrian refugees, as of April 2020. As part of Turkey's migrant crisis, according to UNHCR, in 2018 Turkey was hosting 63.4% of all the refugees in the world, that is 3,564,919 registered refugees from Africa and the Middle East in total.\nLanguages.\nThe official language is Turkish, which is the most widely spoken Turkic language in the world.", "relationMentions": [{"em1Text": "Turkey", "em2Text": "Turkish", "label": "official_language_is"}]}
{"sentText": "Spain (, ), or the Kingdom of Spain (), is a country in southwestern Europe with parts of territory in the Atlantic Ocean and across the Mediterranean Sea. The largest part of Spain is situated on the Iberian Peninsula; its territory also includes the Canary Islands in the Atlantic Ocean, the Balearic Islands in the Mediterranean Sea, the autonomous cities of Ceuta and Melilla, and several minor overseas territories also scattered along the Moroccan coast of the Alboran Sea. The country's mainland is bordered to the south by Gibraltar; to the south and east by the Mediterranean Sea; to the north by France, Andorra and the Bay of Biscay; and to the west by Portugal and the Atlantic Ocean.", "relationMentions": [{"em1Text": "Spain", "em2Text": "Gibraltar", "label": "borders"}, {"em1Text": "Spain", "em2Text": "France", "label": "borders"}, {"em1Text": "Spain", "em2Text": "Andorra", "label": "borders"}, {"em1Text": "Spain", "em2Text": "Portugal", "label": "borders"}]}
{"sentText": "Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Zaragoza, Malaga, Murcia, Palma de Mallorca, Las Palmas de Gran Canaria and Bilbao.", "relationMentions": [{"em1Text": "Madrid", "em2Text": "Spain", "label": "is_capital_of"}, {"em1Text": "Madrid", "em2Text": "Spain", "label": "is_largest_city_of"}]}
{"sentText": "Spain is a multilingual state. Spanish--featured in the 1978 Spanish Constitution as \"castellano\" ('Castilian')--has effectively been the official language of the entire country since 1931.", "relationMentions": [{"em1Text": "Spain", "em2Text": "castellano", "label": "official_language_is"}]}
{"sentText": "Spain is a developed country, a secular parliamentary democracy and a constitutional monarchy, with King Felipe VI as head of state.", "relationMentions": [{"em1Text": "Spain", "em2Text": "secular parliamentary democracy", "label": "has_state_type"}, {"em1Text": "Spain", "em2Text": "constitutional monarchy", "label": "has_state_type"}]}
{"sentText": "Roman Catholicism, which has a long history in Spain, remains the dominant religion.", "relationMentions": [{"em1Text": "Spain", "em2Text": "Roman Catholicism", "label": "majority_religion_is"}]}
{"sentText": "There are several major rivers in Spain such as the Tagus (\"Tajo\"), Ebro, Guadiana, Douro (\"Duero\"), Guadalquivir, Jucar, Segura, Turia and Minho (\"Mino\"). Alluvial plains are found along the coast, the largest of which is that of the Guadalquivir in Andalusia.\nClimate.\nThree main climatic zones can be separated, according to geographical situation and orographic conditions:\nApart from these main types, other sub-types can be found, like the alpine climate in areas with very high altitude, the humid subtropical climate in areas of northeastern Spain and the continental climates (\"Dfc\", \"Dfb\" / \"Dsc\", \"Dsb\") in the Pyrenees as well as parts of the Cantabrian Range, the Central System, Sierra Nevada and the Iberian System, and a typical desert climate (\"BWk\", \"BWh\") in the zone of Almeria, Murcia and eastern Canary Islands. Low-lying areas of the Canary Islands average above during their coolest month, thus having a tropical climate.", "relationMentions": [{"em1Text": "Spain", "em2Text": "alpine climate", "label": "has_climate"}, {"em1Text": "Spain", "em2Text": "humid subtropical climate", "label": "has_climate"}, {"em1Text": "Spain", "em2Text": "continental climates", "label": "has_climate"}, {"em1Text": "Spain", "em2Text": "typical desert climate", "label": "has_climate"}, {"em1Text": "Spain", "em2Text": "tropical climate", "label": "has_climate"}]}
{"sentText": "Sweden ( ), officially the Kingdom of Sweden ( ), is a country in Northern Europe. The largest and most populous of the Nordic countries, it borders Norway to the west and north, Finland to the east, and is connected to Denmark in the southwest by a bridgetunnel across the Oresund. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union, and the fifth largest country in Europe. The capital and largest city is Stockholm.", "relationMentions": [{"em1Text": "Sweden", "em2Text": "Norway", "label": "borders"}, {"em1Text": "Sweden", "em2Text": "Finland", "label": "borders"}, {"em1Text": "Sweden", "em2Text": "Denmark", "label": "borders"}, {"em1Text": "Stockholm", "em2Text": "Sweden", "label": "is_capital_of"}, {"em1Text": "Stockholm", "em2Text": "Sweden", "label": "is_largest_city_of"}, {"em1Text": "Sweden", "em2Text": "Kingdom", "label": "has_state_type"}, {"em1Text": "Sweden", "em2Text": "Kingdom", "label": "has_state_type"}]}
{"sentText": "The official language of Sweden is Swedish, a North Germanic language, related and very similar to Danish and Norwegian, but differing in pronunciation and orthography.", "relationMentions": [{"em1Text": "Sweden", "em2Text": "Swedish", "label": "official_language_is"}]}
{"sentText": "Most of Sweden has a temperate climate, despite its northern latitude, with largely four distinct seasons and mild temperatures throughout the year. The winter in the far south is usually weak and is manifested only through some shorter periods with snow and sub-zero temperatures, autumn may well turn into spring there, without a distinct period of winter. The northern parts of the country have a subarctic climate while the central parts have a humid continental climate. The coastal south can be defined as having either a humid continental climate using the 0 degC isotherm, or an oceanic climate using the -3 degC isotherm.", "relationMentions": [{"em1Text": "Sweden", "em2Text": "temperate climate", "label": "has_climate"}, {"em1Text": "Sweden", "em2Text": "subarctic climate", "label": "has_climate"}, {"em1Text": "Sweden", "em2Text": "continental climate", "label": "has_climate"}, {"em1Text": "Sweden", "em2Text": "humid continental climate", "label": "has_climate"}, {"em1Text": "Sweden", "em2Text": "oceanic climate", "label": "has_climate"}]}
{"sentText": "Sweden maintains its own currency, the Swedish krona (SEK), a result of the Swedes having rejected the euro in a referendum.", "relationMentions": [{"em1Text": "Sweden", "em2Text": "Swedish krona", "label": "currency_is"}]}
{"sentText": "Vatican City (), officially the Vatican City State (; ), is an independent city-state and enclave surrounded by Rome, Italy.", "relationMentions": [{"em1Text": "Vatican City", "em2Text": "City State", "label": "has_state_type"}, {"em1Text": "Vatican City", "em2Text": "independent city-state", "label": "has_state_type"}, {"em1Text": "Vatican City", "em2Text": "Rome", "label": "borders"}, {"em1Text": "Vatican City", "em2Text": "Italy", "label": "borders"}]}
{"sentText": "Vatican City issues its own coins and stamps. It has used the euro as its currency since 1 January 1999, owing to a special agreement with the European Union (council decision 1999-98).", "relationMentions": [{"em1Text": "Vatican City", "em2Text": "euro", "label": "currency_is"}]}
{"sentText": "Ukraine is a unitary republic under a semi-presidential system and a developing country, ranking 74th on the Human Development Index.", "relationMentions": [{"em1Text": "Ukraine", "em2Text": "unitary republic", "label": "has_state_type"}, {"em1Text": "Ukraine", "em2Text": "a semi-presidential system", "label": "has_state_type"}]}
{"sentText": "Kyiv is Ukraine's capital as well as its largest city. The country's language is Ukrainian, and many people are also fluent in Russian.", "relationMentions": [{"em1Text": "Kyiv", "em2Text": "Ukraine", "label": "is_capital_of"}, {"em1Text": "Kyiv", "em2Text": "Ukraine", "label": "is_largest_city_of"}, {"em1Text": "Ukraine", "em2Text": "Ukrainian", "label": "official_language_is"}]}
{"sentText": "Ukraine (, ) is a country in Eastern Europe. It is the second-largest European country after Russia, covering approximately , and has a population of around 40 million people. It is bordered by Russia to the east and northeast; by Belarus to the north; by Poland, Slovakia, and Hungary to the west; and by Romania and Moldova to the southwest; with a coastline along the Black Sea and the Sea of Azov to the south and southeast, respectively. Kyiv is Ukraine's capital as well as its largest city. The country's language is Ukrainian, and many people are also fluent in Russian.", "relationMentions": [{"em1Text": "Ukraine", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Ukraine", "em2Text": "Belarus", "label": "borders"}, {"em1Text": "Ukraine", "em2Text": "Poland", "label": "borders"}, {"em1Text": "Ukraine", "em2Text": "Slovakia", "label": "borders"}, {"em1Text": "Ukraine", "em2Text": "Hungary", "label": "borders"}, {"em1Text": "Ukraine", "em2Text": "Romania", "label": "borders"}, {"em1Text": "Ukraine", "em2Text": "Moldova", "label": "borders"}, {"em1Text": "Ukraine", "em2Text": "Ukrainian", "label": "official_language_is"}]}
{"sentText": "Ukraine has a mostly temperate climate, except for the southern coast of Crimea which has a subtropical climate.", "relationMentions": [{"em1Text": "Ukraine", "em2Text": "temperate climate", "label": "has_climate"}, {"em1Text": "Ukraine", "em2Text": "subtropical climate", "label": "has_climate"}]}
{"sentText": "Ukrainian customs are heavily influenced by Orthodox Christianity, the dominant religion in the country.", "relationMentions": [{"em1Text": "Ukrainian", "em2Text": "Orthodox Christianity", "label": "majority_religion_is"}]}
{"sentText": "The United Kingdom is a unitary parliamentary democracy and constitutional monarchy. The monarch, Queen Elizabeth II, has reigned since 1952. The capital and largest city is London, a global city and financial centre with a metropolitan area population of over 14 million.", "relationMentions": [{"em1Text": "The United Kingdom", "em2Text": "unitary parliamentary democracy", "label": "has_state_type"}, {"em1Text": "The United Kingdom", "em2Text": "constitutional monarchy", "label": "has_state_type"}, {"em1Text": "London", "em2Text": "The United Kingdom", "label": "is_capital_of"}, {"em1Text": "London", "em2Text": "The United Kingdom", "label": "is_largest_city_of"}]}
{"sentText": "The UK's \"de facto\" official language is English.", "relationMentions": [{"em1Text": "UK's", "em2Text": "English", "label": "official_language_is"}]}
{"sentText": "Most of the United Kingdom has a temperate climate, with generally cool temperatures and plentiful rainfall all year round. The temperature varies with the seasons seldom dropping below or rising above . Some parts, away from the coast, of upland England, Wales, Northern Ireland and most of Scotland, experience a subpolar oceanic climate (\"Cfc\"). Higher elevations in Scotland experience a continental subarctic climate (\"Dfc\") and the mountains experience a tundra climate (\"ET\").", "relationMentions": [{"em1Text": "United Kingdom", "em2Text": "temperate climate", "label": "has_climate"}, {"em1Text": "United Kingdom", "em2Text": "subpolar oceanic climate", "label": "has_climate"}, {"em1Text": "United Kingdom", "em2Text": "continental subarctic climate", "label": "has_climate"}, {"em1Text": "United Kingdom", "em2Text": "tundra climate", "label": "has_climate"}]}
{"sentText": "Forms of Christianity have dominated religious life in what is now the United Kingdom for over 1,400 years. Although a majority of citizens still identify with Christianity in many surveys, regular church attendance has fallen dramatically since the middle of the 20th century, while immigration and demographic change have contributed to the growth of other faiths, most notably Islam.", "relationMentions": [{"em1Text": "United Kingdom", "em2Text": "Christianity", "label": "majority_religion_is"}]}
{"sentText": "San Marino (, ), officially the Republic of San Marino (; ), also known as the Most Serene Republic of San Marino (), is a small country (and a European microstate) in Southern Europe enclaved by Italy.", "relationMentions": [{"em1Text": "San Marino", "em2Text": "Italy", "label": "borders"}]}
{"sentText": "San Marino is a landlocked country but the northeastern end is within of the Italian city of Rimini on the Adriatic Sea. The nearest airport is also in Italy. The country's capital city, the City of San Marino, is located atop Mount Titan, while its largest settlement is Dogana within the largest municipality of Serravalle.", "relationMentions": [{"em1Text": "City of San Marino", "em2Text": "San Marino", "label": "is_capital_of"}, {"em1Text": "Dogana", "em2Text": "San Marino", "label": "is_largest_city_of"}]}
{"sentText": "San Marino's official language is Italian.", "relationMentions": [{"em1Text": "San Marino", "em2Text": "Italian", "label": "official_language_is"}]}
{"sentText": "San Marino lies between an oceanic climate and a humid subtropical climate (Koppen climate classification: \"Cfb and Cfa\"), with some continental influences.", "relationMentions": [{"em1Text": "San Marino", "em2Text": "oceanic climate", "label": "has_climate"}, {"em1Text": "San Marino", "em2Text": "humid subtropical climate", "label": "has_climate"}]}
{"sentText": "Marinus then went on to found an independently ruled monastic community on Mount Titan in AD 301; thus, San Marino lays claim to being the oldest extant sovereign state, as well as the oldest constitutional republic.", "relationMentions": [{"em1Text": "San Marino", "em2Text": "constitutional republic", "label": "has_state_type"}]}
{"sentText": "San Marino is the world's smallest republic, although when Nauru gained independence in 1968 it challenged that claim.", "relationMentions": [{"em1Text": "San Marino", "em2Text": "republic", "label": "has_state_type"}]}
{"sentText": "San Marino became a member of the Council of Europe in 1988 and of the United Nations in 1992. It is not a member of the European Union, although it uses the euro as its currency (despite not legally being part of the Eurozone).", "relationMentions": [{"em1Text": "San Marino", "em2Text": "euro", "label": "currency_is"}]}
{"sentText": "San Marino is a predominantly Catholic state, though Catholicism is not an established religion. Over 97% of the population profess the Catholic faith, and approximately half of those practise it.", "relationMentions": [{"em1Text": "San Marino", "em2Text": "Catholic", "label": "majority_religion_is"}, {"em1Text": "San Marino", "em2Text": "Catholicism", "label": "majority_religion_is"}, {"em1Text": "San Marino", "em2Text": "Catholic", "label": "majority_religion_is"}]}
{"sentText": "Russia (, ), or the Russian Federation (RF), is a transcontinental country spanning Eastern Europe and Northern Asia. It is the largest country in the world by area, covering over , and encompassing one-eighth of Earth's inhabitable landmass. Russia extends across eleven time zones and borders sixteen sovereign nations, the most of any country in the world. It is the ninth-most populous country and the most populous country in Europe, with a population of 145.5 million. The country's capital and largest city is Moscow, the largest city entirely within Europe.", "relationMentions": [{"em1Text": "Russia", "em2Text": "sixteen sovereign nations", "label": "borders"}, {"em1Text": "Moscow", "em2Text": "Russia", "label": "is_capital_of"}, {"em1Text": "Moscow", "em2Text": "Russia", "label": "is_largest_city_of"}]}
{"sentText": "Russian is the official and the predominantly spoken language in Russia.", "relationMentions": [{"em1Text": "Russia", "em2Text": "Russian", "label": "official_language_is"}]}
{"sentText": "Most of northwest Russia and Siberia have a subarctic climate, with extremely severe winters in the inner regions of northeast Siberia (mostly Sakha, where the Northern Pole of Cold is located with the record low temperature of ), and more moderate winters elsewhere. Russia's vast coastline along the Arctic Ocean and the Russian Arctic islands have a polar climate.\nThe coastal part of Krasnodar Krai on the Black Sea, most notably Sochi, and some coastal and interior strips of the North Caucasus possess a humid subtropical climate with mild and wet winters. In many regions of East Siberia and the Russian Far East, winter is dry compared to summer; while other parts of the country experience more even precipitation across seasons. Winter precipitation in most parts of the country usually falls as snow. The westernmost parts of Kaliningrad Oblast and some parts in the south of Krasnodar Krai and the North Caucasus have an oceanic climate. The region along the Lower Volga and Caspian Sea coast, as well as some southernmost slivers of Siberia, possess a semi-arid climate.", "relationMentions": [{"em1Text": "Russia", "em2Text": "subarctic climate", "label": "has_climate"}, {"em1Text": "Russia", "em2Text": "polar climate", "label": "has_climate"}, {"em1Text": "Russia", "em2Text": "subtropical climate", "label": "has_climate"}, {"em1Text": "Russia", "em2Text": "climate", "label": "has_climate"}, {"em1Text": "Russia", "em2Text": "semi-arid climate", "label": "has_climate"}]}
{"sentText": "Russia, by constitution, is an asymmetric federal republic, with a semi-presidential system, wherein the president is the head of state, and the prime minister is the head of government.", "relationMentions": [{"em1Text": "Russia", "em2Text": "asymmetric federal republic, with a semi-presidential system", "label": "has_state_type"}]}
{"sentText": "Russia is a secular state by constitution, and its largest religion is Eastern Orthodox Christianity, chiefly represented by the Russian Orthodox Church.", "relationMentions": [{"em1Text": "Russia", "em2Text": "Eastern Orthodox Christianity", "label": "majority_religion_is"}]}
{"sentText": "Latvia ( or ; ; ; ), officially the Republic of Latvia (, , ), is a country in the Baltic region of Northern Europe. It is one of the Baltic states; and is bordered by Estonia to the north, Lithuania to the south, Russia to the east, Belarus to the southeast, and shares a maritime border with Sweden to the west.", "relationMentions": [{"em1Text": "Latvia", "em2Text": "Baltic region of Northern Europe", "label": "located_in"}, {"em1Text": "Latvia", "em2Text": "Estonia", "label": "borders"}, {"em1Text": "Latvia", "em2Text": "Lithuania", "label": "borders"}, {"em1Text": "Latvia", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Latvia", "em2Text": "Belarus", "label": "borders"}, {"em1Text": "Latvia", "em2Text": "Sweden", "label": "borders"}]}
{"sentText": "Latvia covers an area of , with a population of 1.9 million. The country has a temperate seasonal climate. Its capital and largest city is Riga.", "relationMentions": [{"em1Text": "Latvia", "em2Text": "1.9 million", "label": "has_population_of"}, {"em1Text": "Latvia", "em2Text": "temperate seasonal climate", "label": "has_climate"}, {"em1Text": "Riga", "em2Text": "Latvia", "label": "is_capital_of"}, {"em1Text": "Riga", "em2Text": "Latvia", "label": "is_largest_city_of"}]}
{"sentText": "The sole official language of Latvia is Latvian, which belongs to the Baltic language sub-group of the Balto-Slavic branch of the Indo-European language family.", "relationMentions": [{"em1Text": "Latvia", "em2Text": "Latvian", "label": "official_language_is"}]}
{"sentText": "Since then, Latvia has been a democratic unitary parliamentary republic.", "relationMentions": [{"em1Text": "Latvia", "em2Text": "democratic unitary parliamentary republic", "label": "has_state_type"}]}
{"sentText": "In 2014, Riga was the European Capital of Culture, Latvia joined the eurozone and adopted the EU single currency euro as the currency of the country and Latvian Valdis Dombrovskis was named vice-president of the European Commission.", "relationMentions": [{"em1Text": "Latvia", "em2Text": "euro", "label": "currency_is"}]}
{"sentText": "The largest religion in Latvia is Christianity (79%).", "relationMentions": [{"em1Text": "Latvia", "em2Text": "Christianity", "label": "majority_religion_is"}]}
{"sentText": "Kosovo, officially the Republic of Kosovo, is a partially recognised state in Southeast Europe. It lies at the centre of the Balkans. Kosovo unilaterally declared its independence from Serbia on 17 February 2008, and has since gained diplomatic recognition as a sovereign state by 97 member states of the United Nations. It is bordered by Serbia to the north and east, North Macedonia to the southeast, Albania to the southwest, and Montenegro to the west. Most of central Kosovo is dominated by the vast plains and fields of Dukagjini and Kosovo field. The Accursed Mountains and Sar Mountains rise in the southwest and southeast, respectively. Its capital and largest city is Pristina.", "relationMentions": [{"em1Text": "Kosovo", "em2Text": "Southeast Europe", "label": "located_in"}, {"em1Text": "Kosovo", "em2Text": "Serbia", "label": "borders"}, {"em1Text": "Kosovo", "em2Text": "North Macedonia", "label": "borders"}, {"em1Text": "Kosovo", "em2Text": "Albania", "label": "borders"}, {"em1Text": "Kosovo", "em2Text": "Montenegro", "label": "borders"}, {"em1Text": "Pristina", "em2Text": "Kosovo", "label": "is_capital_of"}, {"em1Text": "Pristina", "em2Text": "Kosovo", "label": "is_largest_city_of"}]}
{"sentText": "The official languages of Kosovo are Albanian and Serbian and the institutions are committed to ensure the equal use of those two languages.", "relationMentions": [{"em1Text": "Kosovo", "em2Text": "Albanian", "label": "official_language_is"}, {"em1Text": "Kosovo", "em2Text": "Serbian", "label": "official_language_is"}]}
{"sentText": "The population of Kosovo, as defined by Agency of Statistics, was estimated in 2011 to be approximately 1,740,000.", "relationMentions": [{"em1Text": "Kosovo", "em2Text": "1,740,000", "label": "has_population_of"}]}
{"sentText": "Most of Kosovo experiences predominantly a Continental climate with Mediterranean and Alpine influences.", "relationMentions": [{"em1Text": "Kosovo", "em2Text": "Continental climate", "label": "has_climate"}]}
{"sentText": "Kosovo is a multi-party parliamentary representative democratic republic.", "relationMentions": [{"em1Text": "Kosovo", "em2Text": "multi-party parliamentary representative democratic republic", "label": "has_state_type"}]}
{"sentText": "Kosovo's largest trading partners are Albania, Italy, Switzerland, China, Germany and Turkey. The Euro is its official currency.", "relationMentions": [{"em1Text": "Kosovo", "em2Text": "The Euro", "label": "currency_is"}]}
{"sentText": "Islam is the most widely practiced religion in Kosovo and was introduced in the Middle Ages by the Ottomans.", "relationMentions": [{"em1Text": "Kosovo", "em2Text": "Islam", "label": "majority_religion_is"}]}
{"sentText": "Kazakhstan, officially the Republic of Kazakhstan, is a transcontinental landlocked country located mainly in Central Asia and partly in Eastern Europe. It borders Russia to the north and west, China to the east, Kyrgyzstan to the southeast, Uzbekistan to the south, and Turkmenistan to the southwest. Its capital is Nur-Sultan, formerly known as Astana until 2019.", "relationMentions": [{"em1Text": "Kazakhstan", "em2Text": "Central Asia", "label": "located_in"}, {"em1Text": "Kazakhstan", "em2Text": "Eastern Europe", "label": "located_in"}, {"em1Text": "Kazakhstan", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Kazakhstan", "em2Text": "China", "label": "borders"}, {"em1Text": "Kazakhstan", "em2Text": "Kyrgyzstan", "label": "borders"}, {"em1Text": "Kazakhstan", "em2Text": "Uzbekistan", "label": "borders"}, {"em1Text": "Kazakhstan", "em2Text": "Turkmenistan", "label": "borders"}, {"em1Text": "Nur-Sultan", "em2Text": "Kazakhstan", "label": "is_capital_of"}]}
{"sentText": "Almaty, Kazakhstan's largest city, was the country's capital until 1997. Kazakhstan is the world's largest landlocked country, the world's largest Muslim-majority country by land area (and the northernmost), and the ninth-largest country in the world overall. It has a population of 19 million people, and one of the lowest population densities in the world, at fewer than 6 people per square kilometre (15 people per square mile). The country dominates Central Asia economically and politically, generating 60 percent of the region's GDP, primarily through its oil and gas industry; it also has vast mineral resources. Officially, it is a democratic, secular, unitary, constitutional republic with a diverse cultural heritage.", "relationMentions": [{"em1Text": "Almaty", "em2Text": "Kazakhstan", "label": "is_largest_city_of"}, {"em1Text": "Kazakhstan", "em2Text": "19 million people", "label": "has_population_of"}, {"em1Text": "Kazakhstan", "em2Text": "democratic, secular, unitary, constitutional republic", "label": "has_state_type"}]}
{"sentText": "Kazakhstan is officially a bilingual country. Kazakh, (part of the Kipchak family of Turkic languages) spoken natively by 64.4% of the population, has the status of \"state\" language, whereas Russian, which is spoken by most Kazakhs, is declared an \"official\" language, and is used routinely in business, government, and inter-ethnic communication, although Kazakh is slowly replacing it.", "relationMentions": [{"em1Text": "Kazakhstan", "em2Text": "Kazakh", "label": "official_language_is"}, {"em1Text": "Kazakhstan", "em2Text": "Russian", "label": "official_language_is"}]}
{"sentText": "Kazakhstan has a GDP of $179.332 billion and an annual growth rate of 4.", "relationMentions": [{"em1Text": "Kazakhstan", "em2Text": "$179.332 billion", "label": "gdp_is"}]}
{"sentText": "Kazakhstan has an \"extreme\" continental climate, with hot summers and very cold winters.", "relationMentions": [{"em1Text": "Kazakhstan", "em2Text": "continental climate", "label": "has_climate"}]}
{"sentText": "Islam is the largest religion in Kazakhstan, followed by Eastern Orthodox Christianity.", "relationMentions": [{"em1Text": "Kazakhstan", "em2Text": "Islam", "label": "majority_religion_is"}]}
{"sentText": "Italy ( ), officially the Italian Republic or Republic of Italy ( ), is a country that consists of a peninsula delimited by the Alps and several islands surrounding it, whose territory largely coincides with the homonymous geographical region. Italy is located in the middle of the Mediterranean Sea, in Southern Europe; it is also considered part of Western Europe. A unitary parliamentary republic with Rome as its capital and largest city, the country covers a total area of and shares land borders with France, Switzerland, Austria, Slovenia, as well as the enclaved microstates of Vatican City and San Marino.", "relationMentions": [{"em1Text": "Italy", "em2Text": "Western Europe", "label": "located_in"}, {"em1Text": "Italy", "em2Text": "unitary parliamentary republic", "label": "has_state_type"}, {"em1Text": "Rome", "em2Text": "Italy", "label": "is_capital_of"}, {"em1Text": "Rome", "em2Text": "Italy", "label": "is_largest_city_of"}, {"em1Text": "Italy", "em2Text": "France", "label": "borders"}, {"em1Text": "Italy", "em2Text": "Switzerland", "label": "borders"}, {"em1Text": "Italy", "em2Text": "Austria", "label": "borders"}, {"em1Text": "Italy", "em2Text": "Slovenia", "label": "borders"}, {"em1Text": "Italy", "em2Text": "Vatican City", "label": "borders"}, {"em1Text": "Italy", "em2Text": "San Marino", "label": "borders"}]}
{"sentText": "Italy's official language is Italian, as stated by the framework law no.", "relationMentions": [{"em1Text": "Italy", "em2Text": "Italian", "label": "official_language_is"}]}
{"sentText": "At the beginning of 2020, Italy had 60,317,116 inhabitants.", "relationMentions": [{"em1Text": "Italy", "em2Text": "60,317,116", "label": "has_population_of"}]}
{"sentText": "These seas constitute a reservoir of heat and humidity for Italy. Within the southern temperate zone, they determine a Mediterranean climate with local differences due to the geomorphology of the territory, which tends to make its mitigating effects felt, especially in high pressure conditions.", "relationMentions": [{"em1Text": "Italy", "em2Text": "Mediterranean climate", "label": "has_climate"}]}
{"sentText": "Because of the length of the peninsula and the mostly mountainous hinterland, the climate of Italy is highly diverse. In most of the inland northern and central regions, the climate ranges from humid subtropical to humid continental and oceanic.", "relationMentions": [{"em1Text": "Italy", "em2Text": "humid subtropical", "label": "has_climate"}, {"em1Text": "Italy", "em2Text": "humid continental", "label": "has_climate"}, {"em1Text": "Italy", "em2Text": "oceanic", "label": "has_climate"}]}
{"sentText": "Italy introduced the common European currency, the Euro in 2002.", "relationMentions": [{"em1Text": "Italy", "em2Text": "the Euro", "label": "currency_is"}]}
{"sentText": "Ireland ( ), also known as the Republic of Ireland ('), is a country in north-western Europe consisting of 26 of the 32 counties of the island of Ireland. The capital and largest city is Dublin, on the eastern side of the island. Around 40% of the country's population of 5 million people resides in the Greater Dublin Area. The sovereign state shares its only land border with Northern Ireland, which is part of the United Kingdom. It is otherwise surrounded by the Atlantic Ocean, with the Celtic Sea to the south, St George's Channel to the south-east, and the Irish Sea to the east. It is a unitary, parliamentary republic.", "relationMentions": [{"em1Text": "Ireland", "em2Text": "north-western Europe", "label": "located_in"}, {"em1Text": "Dublin", "em2Text": "Ireland", "label": "is_capital_of"}, {"em1Text": "Dublin", "em2Text": "Ireland", "label": "is_largest_city_of"}, {"em1Text": "Ireland", "em2Text": "Northern Ireland", "label": "borders"}, {"em1Text": "Ireland", "em2Text": "unitary, parliamentary republic", "label": "has_state_type"}]}
{"sentText": "The population of Ireland stood at 4,761,865 in 2016, an increase of 12.", "relationMentions": [{"em1Text": "Ireland", "em2Text": "4,761,865", "label": "has_population_of"}]}
{"sentText": "The following is a list of functional urban areas in Ireland (as defined by the OECD) and their approximate populations . Languages. The Irish Constitution describes Irish as the \"national language\" and the \"first official language\", but English (the \"second official language\") is the dominant language.", "relationMentions": [{"em1Text": "Ireland", "em2Text": "English", "label": "official_language_is"}, {"em1Text": "Ireland", "em2Text": "Irish", "label": "official_language_is"}]}
{"sentText": "The Atlantic Ocean and the warming influence of the Gulf Stream affect weather patterns in Ireland. Temperatures differ regionally, with central and eastern areas tending to be more extreme.However, due to a temperate oceanic climate, temperatures are seldom lower than in winter or higher than in summer.", "relationMentions": [{"em1Text": "Ireland", "em2Text": "temperate oceanic climate", "label": "has_climate"}]}
{"sentText": "Ireland adopted the euro currency in 2002 along with eleven other EU member states.", "relationMentions": [{"em1Text": "Ireland", "em2Text": "the euro", "label": "currency_is"}]}
{"sentText": "Christianity is the predominant religion, and while Ireland remains a predominantly Catholic country, the percentage of the population who identified as Catholic on the census has fallen sharply from 84.", "relationMentions": [{"em1Text": "Ireland", "em2Text": "Christianity", "label": "majority_religion_is"}]}
{"sentText": "Iceland (; ) is a Nordic island country in the North Atlantic Ocean and the most sparsely populated country in Europe.", "relationMentions": [{"em1Text": "Iceland", "em2Text": "North Atlantic Ocean", "label": "located_in"}]}
{"sentText": "Iceland's capital and largest city is Reykjavik, which (along with its surrounding areas) is home to over 65% of the population.", "relationMentions": [{"em1Text": "Reykjavik", "em2Text": "Iceland", "label": "is_capital_of"}, {"em1Text": "Reykjavik", "em2Text": "Iceland", "label": "is_largest_city_of"}]}
{"sentText": "Iceland's official written and spoken language is Icelandic, a North Germanic language descended from Old Norse.", "relationMentions": [{"em1Text": "Iceland", "em2Text": "Icelandic", "label": "official_language_is"}]}
{"sentText": "Iceland is warmed by the Gulf Stream and has a temperate climate, despite a high latitude just outside the Arctic Circle.", "relationMentions": [{"em1Text": "Iceland", "em2Text": "temperate climate", "label": "has_climate"}]}
{"sentText": "Iceland is a representative democracy and a parliamentary republic.", "relationMentions": [{"em1Text": "Iceland", "em2Text": "parliamentary republic", "label": "has_state_type"}]}
{"sentText": "The national currency of Iceland is the Icelandic krona (ISK).", "relationMentions": [{"em1Text": "Iceland", "em2Text": "the Icelandic krona", "label": "currency_is"}]}
{"sentText": "Hungary ( ) is a landlocked country in Central Europe. Spanning of the Carpathian Basin, it is bordered by Slovakia to the north, Ukraine to the northeast, Romania to the east and southeast, Serbia to the south, Croatia and Slovenia to the southwest, and Austria to the west.", "relationMentions": [{"em1Text": "Hungary", "em2Text": "Central Europe", "label": "located_in"}, {"em1Text": "Hungary", "em2Text": "Slovakia", "label": "borders"}, {"em1Text": "Hungary", "em2Text": "Ukraine", "label": "borders"}, {"em1Text": "Hungary", "em2Text": "Romania", "label": "borders"}, {"em1Text": "Hungary", "em2Text": "Serbia", "label": "borders"}, {"em1Text": "Hungary", "em2Text": "Croatia", "label": "borders"}, {"em1Text": "Hungary", "em2Text": "Slovenia", "label": "borders"}, {"em1Text": "Hungary", "em2Text": "Austria", "label": "borders"}]}
{"sentText": "Hungary has a population of nearly 10 million, mostly ethnic Hungarians and a significant Romani minority. Hungarian, the official language, is the world's most widely spoken Uralic language, and among the few non-Indo-European languages widely spoken in Europe. Budapest is the country's capital and largest city; other major urban areas include Debrecen, Szeged, Miskolc, Pecs, and Gyor.", "relationMentions": [{"em1Text": "Hungary", "em2Text": "10 million", "label": "has_population_of"}, {"em1Text": "Hungary", "em2Text": "Hungarian", "label": "official_language_is"}, {"em1Text": "Budapest", "em2Text": "Hungary", "label": "is_capital_of"}, {"em1Text": "Budapest", "em2Text": "Hungary", "label": "is_largest_city_of"}]}
{"sentText": "Hungary has a temperate seasonal climate, with generally warm summers with low overall humidity levels but frequent rainshowers and cold snowy winters.", "relationMentions": [{"em1Text": "Hungary", "em2Text": "temperate seasonal climate", "label": "has_climate"}]}
{"sentText": "On 23 October 1989, Hungary again became a democratic parliamentary republic.", "relationMentions": [{"em1Text": "Hungary", "em2Text": "democratic parliamentary republic", "label": "has_state_type"}]}
{"sentText": "Hungary maintains its own currency, the Hungarian forint (HUF), although the economy fulfills the Maastricht criteria with the exception of public debt, but it is also significantly below the EU average with the level of 75.", "relationMentions": [{"em1Text": "Hungary", "em2Text": "the Hungarian forint", "label": "currency_is"}]}
{"sentText": "Hungary is a historically Christian country.", "relationMentions": [{"em1Text": "Hungary", "em2Text": "Christian", "label": "majority_religion_is"}]}
{"sentText": "Greece (, ), officially the Hellenic Republic, is a country in Southeast Europe.", "relationMentions": [{"em1Text": "Greece", "em2Text": "Southeast Europe", "label": "located_in"}]}
{"sentText": "Greece shares land borders with Albania to the northwest, North Macedonia and Bulgaria to the north, and Turkey to the northeast.", "relationMentions": [{"em1Text": "Greece", "em2Text": "Albania", "label": "borders"}, {"em1Text": "Greece", "em2Text": "North Macedonia", "label": "borders"}, {"em1Text": "Greece", "em2Text": "Bulgaria", "label": "borders"}, {"em1Text": "Greece", "em2Text": "Turkey", "label": "borders"}]}
{"sentText": "Greece has the longest coastline on the Mediterranean Basin, featuring thousands of islands. The country consists of nine traditional geographic regions, and has a population of approximately 10.7 million. Athens is the nation's capital and largest city, followed by Thessaloniki.", "relationMentions": [{"em1Text": "Greece", "em2Text": "10.7 million", "label": "has_population_of"}, {"em1Text": "Athens", "em2Text": "Greece", "label": "is_capital_of"}, {"em1Text": "Athens", "em2Text": "Greece", "label": "is_largest_city_of"}]}
{"sentText": "In terms of per capita income, Greece is ranked 41st or 47th in the world at $18,168 and $29,045 for nominal GDP and PPP respectively.", "relationMentions": [{"em1Text": "Greece", "em2Text": "$18,168", "label": "gdp_is"}]}
{"sentText": "The climate of Greece is primarily Mediterranean, featuring mild, wet winters and hot, dry summers. This climate occurs at all coastal locations, including Athens, the Cyclades, the Dodecanese, Crete, the Peloponnese, the Ionian Islands and parts of the Central Continental Greece region. The Pindus mountain range strongly affects the climate of the country, as areas to the west of the range are considerably wetter on average (due to greater exposure to south-westerly systems bringing in moisture) than the areas lying to the east of the range (due to a rain shadow effect). The mountainous areas of Northwestern Greece (parts of Epirus, Central Greece, Thessaly, Western Macedonia) as well as in the mountainous central parts of Peloponnese - including parts of the regional units of Achaea, Arcadia and Laconia - feature an Alpine climate with heavy snowfalls. The inland parts of northern Greece, in Central Macedonia and East Macedonia and Thrace feature a temperate climate with cold, damp winters and hot, dry summers with frequent thunderstorms.", "relationMentions": [{"em1Text": "Greece", "em2Text": "Mediterranean", "label": "has_climate"}, {"em1Text": "Greece", "em2Text": "Alpine", "label": "has_climate"}, {"em1Text": "Greece", "em2Text": "temperate", "label": "has_climate"}]}
{"sentText": "Greece is a unitary parliamentary republic, and a developed country, with an advanced high-income economy, and a high quality of life, ranking 32nd in the Human Development Index.", "relationMentions": [{"em1Text": "Greece", "em2Text": "unitary parliamentary republic", "label": "has_state_type"}]}
{"sentText": "Greece became the tenth member of the European Communities (subsequently subsumed by the European Union) on 1 January 1981, ushering in a period of sustained growth. Widespread investments in industrial enterprises and heavy infrastructure, as well as funds from the European Union and growing revenues from tourism, shipping, and a fast-growing service sector raised the country's standard of living to unprecedented levels. Traditionally strained relations with neighbouring Turkey improved when successive earthquakes hit both nations in 1999, leading to the lifting of the Greek veto against Turkey's bid for EU membership. Recent history. The country adopted the euro in 2001 and successfully hosted the 2004 Summer Olympic Games in Athens.", "relationMentions": [{"em1Text": "Greece", "em2Text": "the euro", "label": "currency_is"}]}
{"sentText": "The results come from the preliminary figures of the population census that took place in Greece in May 2011. Religion. The Greek Constitution recognises Eastern Orthodoxy as the 'prevailing' faith of the country, while guaranteeing freedom of religious belief for all.", "relationMentions": [{"em1Text": "Greece", "em2Text": "Eastern Orthodoxy", "label": "majority_religion_is"}]}
{"sentText": "France (), officially the French Republic (), is a transcontinental country spanning Western Europe and overseas regions and territories in the Americas and the Atlantic, Pacific and Indian Oceans.", "relationMentions": [{"em1Text": "France", "em2Text": "Western Europe", "label": "located_in"}, {"em1Text": "France", "em2Text": "overseas regions and territories in the Americas and the Atlantic, Pacific and Indian Oceans", "label": "located_in"}]}
{"sentText": "France borders Belgium, Luxembourg, Germany, Switzerland, Monaco, Italy, Andorra, and Spain in continental Europe, as well as the Netherlands, Suriname, and Brazil in the Americas via its overseas territories in French Guiana and Saint Martin.", "relationMentions": [{"em1Text": "France", "em2Text": "Belgium", "label": "borders"}, {"em1Text": "France", "em2Text": "Luxembourg", "label": "borders"}, {"em1Text": "France", "em2Text": "Germany", "label": "borders"}, {"em1Text": "France", "em2Text": "Switzerland", "label": "borders"}, {"em1Text": "France", "em2Text": "Monaco", "label": "borders"}, {"em1Text": "France", "em2Text": "Italy", "label": "borders"}, {"em1Text": "France", "em2Text": "Andorra", "label": "borders"}, {"em1Text": "France", "em2Text": "Spain", "label": "borders"}, {"em1Text": "France", "em2Text": "Netherlands", "label": "borders"}, {"em1Text": "France", "em2Text": "Suriname", "label": "borders"}, {"em1Text": "France", "em2Text": "Brazil", "label": "borders"}]}
{"sentText": "France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre; other major urban areas include Marseille, Lyon, Toulouse, Lille, Bordeaux, and Nice.", "relationMentions": [{"em1Text": "France", "em2Text": "unitary semi-presidential republic", "label": "has_state_type"}, {"em1Text": "Paris", "em2Text": "France", "label": "is_capital_of"}, {"em1Text": "Paris", "em2Text": "France", "label": "is_largest_city_of"}]}
{"sentText": "With an estimated May 2021 population of 67.413 million people, France is the 20th most populous country in the world, the third-most populous in Europe (after Russia and Germany), and the second most populous in the European Union (after Germany).", "relationMentions": [{"em1Text": "France", "em2Text": "67.413 million people", "label": "has_population_of"}]}
{"sentText": "Catholicism has been the predominant religion in France for more than a millennium, though it is not as actively practised today as it was.", "relationMentions": [{"em1Text": "France", "em2Text": "Catholicism", "label": "majority_religion_is"}]}
{"sentText": "Finland ( ; ), officially the Republic of Finland (; ), is a Nordic country in Northern Europe. It shares land borders with Sweden to the northwest, Norway to the north, and Russia to the east, with the Gulf of Bothnia to the west and the Gulf of Finland across Estonia to the south.", "relationMentions": [{"em1Text": "Finland", "em2Text": "Northern Europe", "label": "located_in"}, {"em1Text": "Finland", "em2Text": "Sweden", "label": "borders"}, {"em1Text": "Finland", "em2Text": "Norway", "label": "borders"}, {"em1Text": "Finland", "em2Text": "Russia", "label": "borders"}]}
{"sentText": "Finland covers an area of with a population of 5.5 million. Helsinki is the capital and largest city, forming a larger metropolitan area with the neighbouring cities of Espoo, Kauniainen, and Vantaa. The vast majority of the population are ethnic Finns; Finnish, alongside Swedish, are the official languages.", "relationMentions": [{"em1Text": "Finland", "em2Text": "5.5 million", "label": "has_population_of"}, {"em1Text": "Helsinki", "em2Text": "Finland", "label": "is_capital_of"}, {"em1Text": "Helsinki", "em2Text": "Finland", "label": "is_largest_city_of"}, {"em1Text": "Finland", "em2Text": "Finnish", "label": "official_language_is"}, {"em1Text": "Finland", "em2Text": "Swedish", "label": "official_language_is"}]}
{"sentText": "Finland's climate varies from humid continental in the south to the boreal in the north.", "relationMentions": [{"em1Text": "Finland", "em2Text": "humid continental", "label": "has_climate"}, {"em1Text": "Finland", "em2Text": "boreal", "label": "has_climate"}]}
{"sentText": "The Constitution of Finland defines the political system; Finland is a parliamentary republic within the framework of a representative democracy.", "relationMentions": [{"em1Text": "Finland", "em2Text": "parliamentary republic within the framework of a representative democracy", "label": "has_state_type"}]}
{"sentText": "In 2017, Finland's GDP reached EUR224  billion.", "relationMentions": [{"em1Text": "Finland", "em2Text": "EUR224  billion", "label": "gdp_is"}]}
{"sentText": "Estonia ( ), officially the Republic of Estonia (), is a country in Northern Europe. It is bordered to the north by the Gulf of Finland across from Finland, to the west by the Baltic Sea across from Sweden, to the south by Latvia, and to the east by Lake Peipus and Russia. The territory of Estonia consists of the mainland, the larger islands of Saaremaa and Hiiumaa, and over 2,200 other islands and islets on the eastern coast of the Baltic Sea, covering a total area of . The capital city Tallinn and Tartu are the two largest urban areas of the country.", "relationMentions": [{"em1Text": "Estonia", "em2Text": "Northern Europe", "label": "located_in"}, {"em1Text": "Estonia", "em2Text": "Latvia", "label": "borders"}, {"em1Text": "Estonia", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Estonia", "em2Text": "Finland", "label": "borders"}, {"em1Text": "Estonia", "em2Text": "Sweden", "label": "borders"}, {"em1Text": "Tallinn", "em2Text": "Estonia", "label": "is_capital_of"}, {"em1Text": "Tallinn", "em2Text": "Estonia", "label": "is_largest_city_of"}, {"em1Text": "Tartu", "em2Text": "Estonia", "label": "is_largest_city_of"}]}
{"sentText": "The Estonian language is the autochthonous and the official language of Estonia; it is the first language of the majority of its population, as well as the world's second most spoken Finnic language.", "relationMentions": [{"em1Text": "Estonia", "em2Text": "Estonian", "label": "official_language_is"}]}
{"sentText": "The sovereign state of Estonia is a democratic unitary parliamentary republic, administratively subdivided into 15 \"maakond\" (counties). With a population of just over 1.3 million, it is one of the least populous members of the European Union, the Eurozone, the OECD, the Schengen Area, and NATO.", "relationMentions": [{"em1Text": "Estonia", "em2Text": "1.3 million", "label": "has_population_of"}, {"em1Text": "Estonia", "em2Text": "democratic unitary parliamentary republic", "label": "has_state_type"}]}
{"sentText": "As a member of the European Union, Estonia is considered a high-income economy by the World Bank. The GDP (PPP) per capita of the country was $29,312 in 2016 according to the International Monetary Fund.", "relationMentions": [{"em1Text": "Estonia", "em2Text": "$29,312", "label": "gdp_is"}]}
{"sentText": "Estonia is situated in the northern part of the temperate climate zone and in the transition zone between maritime and .", "relationMentions": [{"em1Text": "Estonia", "em2Text": "maritime", "label": "has_climate"}]}
{"sentText": "Beginning 1 January 2011, Estonia adopted the euro and became the 17th eurozone member state.", "relationMentions": [{"em1Text": "Estonia", "em2Text": "euro", "label": "currency_is"}]}
{"sentText": "New polls about religiosity in the European Union in 2012 by Eurobarometer found that Christianity is the largest religion in Estonia accounting for 45% of Estonians.", "relationMentions": [{"em1Text": "Estonia", "em2Text": "Christianity", "label": "majority_religion_is"}]}
{"sentText": "Georgia (, ; ) is a country located in the Caucasus, at the intersection of Eastern Europe and Western Asia. It is bounded by the Black Sea to the west, by Russia to the north and east, by Turkey to the southwest, by Armenia to the south, and by Azerbaijan to the southeast. The country covers an area of , and has a population of 3.7 million people (excluding the Russian-occupied Georgian territories). Georgia is a representative democracy governed as a unitary parliamentary republic. Tbilisi is its capital as well as its largest city, and is home to roughly a third of the Georgian population.", "relationMentions": [{"em1Text": "Georgia", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Georgia", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Georgia", "em2Text": "Armenia", "label": "borders"}, {"em1Text": "Georgia", "em2Text": "Azerbaijan", "label": "borders"}, {"em1Text": "Georgia", "em2Text": "3.7 million", "label": "has_population_of"}, {"em1Text": "Tbilisi", "em2Text": "Georgia", "label": "is_capital_of"}, {"em1Text": "Tbilisi", "em2Text": "Georgia", "label": "is_largest_city_of"}, {"em1Text": "Georgia", "em2Text": "representative democracy governed as a unitary parliamentary republic", "label": "has_state_type"}, {"em1Text": "Georgia", "em2Text": "Eastern Europe", "label": "located_in"}]}
{"sentText": "2015 calculations place Georgia's nominal GDP at US$13.98 billion.", "relationMentions": [{"em1Text": "Georgia", "em2Text": "US$13.98 billion", "label": "gdp_is"}]}
{"sentText": "Eastern Georgia has a transitional climate from humid subtropical to continental.", "relationMentions": [{"em1Text": "Georgia", "em2Text": "transitional climate", "label": "has_climate"}]}
{"sentText": "The official languages of Georgia are Georgian, with Abkhaz having official status within the autonomous region of Abkhazia. Georgian is the primary language of 87.7 per cent of the population, followed by 6.2 per cent speaking Azerbaijani, 3.9 per cent Armenian, 1.2 per cent Russian, and 1 per cent other languages. Azerbaijani once served as a \"lingua franca\" for communication among various nationalities inhabiting Eastern Caucasus. Religion. Today 83.4 per cent of the population practices Eastern Orthodox Christianity, with the majority of these adhering to the national Georgian Orthodox Church.", "relationMentions": [{"em1Text": "Georgia", "em2Text": "Georgian", "label": "official_language_is"}, {"em1Text": "Georgia", "em2Text": "Eastern Orthodox Christianity", "label": "majority_religion_is"}]}
{"sentText": "Cyprus (), officially the Republic of Cyprus, is an island country in the eastern Mediterranean Sea south of the Anatolian Peninsula. It is the third-largest and third-most populous island in the Mediterranean, and is south of Turkey and west of Syria. Its capital and largest city is Nicosia.", "relationMentions": [{"em1Text": "Cyprus", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Cyprus", "em2Text": "eastern Mediterranean Sea", "label": "located_in"}, {"em1Text": "Cyprus", "em2Text": "Mediterranean", "label": "located_in"}, {"em1Text": "Cyprus", "em2Text": "Nicosia", "label": "is_capital_of"}, {"em1Text": "Cyprus", "em2Text": "Nicosia", "label": "is_largest_city_of"}, {"em1Text": "Cyprus", "em2Text": "Anatolian Peninsula", "label": "borders"}, {"em1Text": "Cyprus", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Cyprus", "em2Text": "Syria", "label": "borders"}]}
{"sentText": "Cyprus has two official languages, Greek and Turkish. Armenian and Cypriot Maronite Arabic are recognised as minority languages.", "relationMentions": [{"em1Text": "Cyprus", "em2Text": "Greek", "label": "official_language_is"}, {"em1Text": "Cyprus", "em2Text": "Turkish", "label": "official_language_is"}, {"em1Text": "Cyprus", "em2Text": "Armenian", "label": "official_language_is"}, {"em1Text": "Cyprus", "em2Text": "Cypriot Maronite Arabic", "label": "official_language_is"}]}
{"sentText": "Cyprus has a subtropical climate - Mediterranean and semi-arid type (in the north-eastern part of the island) - Koppen climate classifications \"Csa\" and \"BSh\", with very mild winters (on the coast) and warm to hot summers.", "relationMentions": [{"em1Text": "Cyprus", "em2Text": "subtropical", "label": "has_climate"}, {"em1Text": "Cyprus", "em2Text": "Mediterranean", "label": "has_climate"}, {"em1Text": "Cyprus", "em2Text": "very mild winters", "label": "has_climate"}, {"em1Text": "Cyprus", "em2Text": "warm to hot summers", "label": "has_climate"}]}
{"sentText": "Economic policy of the Cyprus government has focused on meeting the criteria for admission to the European Union. The Cypriot government adopted the euro as the national currency on 1 January 2008.", "relationMentions": [{"em1Text": "Cyprus", "em2Text": "euro", "label": "has_climate"}]}
{"sentText": "The majority of Greek Cypriots identify as Christians, specifically Greek Orthodox, whereas most Turkish Cypriots are adherents of Sunni Islam. According to Eurobarometer 2005, Cyprus was the second most religious state in the European Union at that time, after Malta (although in 2005 Romania wasn't in the European Union; currently Romania is the most religious state in the EU) \"(see Religion in the European Union)\".", "relationMentions": [{"em1Text": "Cyprus", "em2Text": "Christians", "label": "majority_religion_is"}, {"em1Text": "Cyprus", "em2Text": "Greek Orthodox", "label": "majority_religion_is"}]}
{"sentText": "Croatia (, ; , ), officially the Republic of Croatia (, ), is a country at the crossroads of Central and Southeast Europe. It shares a coastline along the Adriatic Sea. It borders Slovenia to the northwest, Hungary to the northeast, Serbia to the east, Bosnia and Herzegovina and Montenegro to the southeast, and shares a maritime border with Italy to the west and southwest.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Croatia", "em2Text": "Central and Southeast Europe", "label": "located_in"}, {"em1Text": "Croatia", "em2Text": "Adriatic Sea", "label": "borders"}, {"em1Text": "Croatia", "em2Text": "Slovenia", "label": "borders"}, {"em1Text": "Croatia", "em2Text": "Hungary", "label": "borders"}, {"em1Text": "Croatia", "em2Text": "Serbia", "label": "borders"}, {"em1Text": "Croatia", "em2Text": "Bosnia and Herzegovina", "label": "borders"}, {"em1Text": "Croatia", "em2Text": "Montenegro", "label": "borders"}, {"em1Text": "Croatia", "em2Text": "Italy", "label": "borders"}]}
{"sentText": "Croatia's capital and largest city, Zagreb, forms one of the country's primary subdivisions, with twenty counties. The country spans an area of , hosting a population of nearly 3.9 million.\nThe Croats arrived in the 6th century.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "Zagreb", "label": "is_capital_of"}, {"em1Text": "Croatia", "em2Text": "Zagreb", "label": "is_largest_city_of"}, {"em1Text": "Croatia", "em2Text": "3.9 million", "label": "has_population_of"}, {"em1Text": "Croatia", "em2Text": "Croats", "label": "one_of_ethnicity"}]}
{"sentText": "Croatia is a republic governed under a parliamentary system.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "republic", "label": "has_state_type"}, {"em1Text": "Croatia", "em2Text": "parliamentary system", "label": "has_state_type"}]}
{"sentText": "Croatia is set to replace its national currency, the Croatian kuna with the Euro from 1 January 2023, officially becoming the 20th Eurozone member.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "Croatian kuna", "label": "currency_is"}]}
{"sentText": "Croatian is the official language of Croatia and became the 24th official language of the European Union upon its accession in 2013.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "Croatian", "label": "official_language_is"}]}
{"sentText": "There are three major dialects spoken on the territory of Croatia, with standard Croatian based on the Shtokavian dialect. The Chakavian and Kajkavian dialects are distinguished from Shtokavian by their lexicon, phonology and syntax.\nCroatian replaced Latin as the official language of the Croatian government in the 19th century.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "Croatian", "label": "official_language_is"}, {"em1Text": "Croatia", "em2Text": "Croatian", "label": "official_language_is"}]}
{"sentText": "Most of Croatia has a moderately warm and rainy continental climate as defined by the Koppen climate classification. Mean monthly temperature ranges between in January and in July. The coldest parts of the country are Lika and Gorski Kotar featuring a snowy, forested climate at elevations above . The warmest areas are at the Adriatic coast and especially in its immediate hinterland characterised by Mediterranean climate, as the sea moderates temperature highs.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "rainy continental", "label": "has_climate"}, {"em1Text": "Croatia", "em2Text": "Mediterranean", "label": "has_climate"}]}
{"sentText": "The Republic of Croatia is a unitary, constitutional state using a parliamentary system.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Croatia", "em2Text": "parliamentary system", "label": "has_state_type"}]}
{"sentText": "Croatia has no official religion. Freedom of religion is a Constitutional right that protects all religious communities as equal before the law and separated from the state. According to the 2011 census, 91.36% of Croatians identify as Christian; of these, Catholics make up the largest group, accounting for 86.", "relationMentions": [{"em1Text": "Croatia", "em2Text": "Christian", "label": "majority_religion_is"}, {"em1Text": "Croatia", "em2Text": "Catholics", "label": "majority_religion_is"}]}
{"sentText": "Bosnia and Herzegovina ( / , ), abbreviated BiH or B&amp;H, sometimes called Bosnia-Herzegovina and often known informally as Bosnia, is a country at the crossroads of south and southeast Europe, located in the Balkans. The capital and largest city is Sarajevo.", "relationMentions": [{"em1Text": "Bosnia and Herzegovina", "em2Text": "south and southeast Europe", "label": "located_in"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Balkans", "label": "located_in"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Sarajevo", "label": "is_capital_of"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Sarajevo", "label": "is_largest_city_of"}]}
{"sentText": "Bosnia, which is the inland region of the country, has a moderate continental climate with hot summers and cold, snowy winters.", "relationMentions": [{"em1Text": "Bosnia", "em2Text": "moderate continental", "label": "has_climate"}, {"em1Text": "Bosnia", "em2Text": "hot summers and cold, snowy winters", "label": "has_climate"}]}
{"sentText": "Bosnia and Herzegovina borders Serbia to the east, Montenegro to the southeast, and Croatia to the north and southwest. In the south it has a long coast, exiting on the Adriatic Sea within the Mediterranean, around the town of Neum. Bosnia, which is the inland region of the country, has a moderate continental climate with hot summers and cold, snowy winters.", "relationMentions": [{"em1Text": "Bosnia and Herzegovina", "em2Text": "Serbia", "label": "borders"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Montenegro", "label": "borders"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Bosnia and Herzegovina", "label": "borders"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Croatia", "label": "borders"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Mediterranean", "label": "borders"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Bosnia", "label": "located_in"}]}
{"sentText": "The Bosniaks are the largest group of the three, the Serbs are the second-largest, and the Croats are the third-largest. In English, all natives of Bosnia and Herzegovina, regardless of ethnicity, are called Bosnian.", "relationMentions": [{"em1Text": "Bosnia and Herzegovina", "em2Text": "Bosniaks", "label": "one_of_ethnicity"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Serbs", "label": "one_of_ethnicity"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Croats", "label": "one_of_ethnicity"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Bosnian", "label": "one_of_ethnicity"}]}
{"sentText": "The national currency is the (Euro-pegged) Convertible Mark (KM), controlled by the currency board. Annual inflation is the lowest relative to other countries in the region at 1.9% in 2004. The international debt was $5.1 billion (as of 31 December 2014). Real GDP growth rate was 5% for 2004 according to the Central Bank of Bosnia and Herzegovina and Statistical Office of Bosnia and Herzegovina.", "relationMentions": [{"em1Text": "Bosnia and Herzegovina", "em2Text": "Convertible Mark", "label": "currency_is"}]}
{"sentText": "Bosnia and Herzegovina is a religiously diverse country. According to the 2013 census, Muslims comprised 50.7% of the population, while Orthodox Christians made 30.", "relationMentions": [{"em1Text": "Bosnia and Herzegovina", "em2Text": "Muslims", "label": "majority_religion_is"}, {"em1Text": "Bosnia and Herzegovina", "em2Text": "Orthodox Christians", "label": "majority_religion_is"}]}
{"sentText": "Bosnia's constitution does not specify any official languages. However, academics Hilary Footitt and Michael Kelly note the Dayton Agreement states it is \"done in Bosnian, Croatian, English and Serbian\", and they describe this as the \"de facto recognition of three official languages\" at the state level.", "relationMentions": [{"em1Text": "Bosnia", "em2Text": "Bosnian", "label": "official_language_is"}, {"em1Text": "Bosnia", "em2Text": "Croatian", "label": "official_language_is"}, {"em1Text": "Bosnia", "em2Text": "English", "label": "official_language_is"}, {"em1Text": "Bosnia", "em2Text": "Serbian", "label": "official_language_is"}]}
{"sentText": "Covering an area of and with a population of 9.3 million, Belarus is the 13th-largest and the 20th-most populous country in Europe.", "relationMentions": [{"em1Text": "Belarus", "em2Text": "9.3 million", "label": "has_population_of"}]}
{"sentText": "Belarus, officially the Republic of Belarus, is a landlocked country in Eastern Europe. It is bordered by Russia to the east and northeast, Ukraine to the south, Poland to the west, and Lithuania and Latvia to the northwest. Covering an area of and with a population of 9.3 million, Belarus is the 13th-largest and the 20th-most populous country in Europe. The country is administratively divided into seven regions. Minsk is the capital and largest city.", "relationMentions": [{"em1Text": "Belarus", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Belarus", "em2Text": "Eastern Europe", "label": "located_in"}, {"em1Text": "Belarus", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Belarus", "em2Text": "Ukraine", "label": "borders"}, {"em1Text": "Belarus", "em2Text": "Poland", "label": "borders"}, {"em1Text": "Belarus", "em2Text": "Lithuania", "label": "borders"}, {"em1Text": "Belarus", "em2Text": "Latvia", "label": "borders"}, {"em1Text": "Belarus", "em2Text": "Minsk", "label": "is_capital_of"}, {"em1Text": "Belarus", "em2Text": "Minsk", "label": "is_largest_city_of"}]}
{"sentText": "1 million with ethnic Belarusians constituting 84.9% of Belarus's total population. Minority groups include: Russians (7.5%), Poles (3.1%), and Ukrainians (1.", "relationMentions": [{"em1Text": "Belarus", "em2Text": "Belarusians", "label": "one_of_ethnicity"}, {"em1Text": "Belarus", "em2Text": "Russians", "label": "one_of_ethnicity"}, {"em1Text": "Belarus", "em2Text": "Poles", "label": "one_of_ethnicity"}, {"em1Text": "Belarus", "em2Text": "Ukrainians", "label": "one_of_ethnicity"}]}
{"sentText": "The currency of Belarus is the Belarusian ruble.", "relationMentions": [{"em1Text": "Belarus", "em2Text": "Belarusian ruble", "label": "currency_is"}]}
{"sentText": "% of all Belarusians in Belarus adhered to some kind of religion; out of those, Eastern Orthodoxy (Belarusian Exarchate of the Russian Orthodox Church) made up about 82%.", "relationMentions": [{"em1Text": "Belarus", "em2Text": "Eastern Orthodoxy", "label": "majority_religion_is"}]}
{"sentText": "Belarus's two official languages are Russian and Belarusian; Russian is the most common language spoken at home, used by 70% of the population, while Belarusian, the official first language, is spoken at home by 23%.", "relationMentions": [{"em1Text": "Belarus", "em2Text": "Russian", "label": "official_language_is"}, {"em1Text": "Belarus", "em2Text": "Belarusian", "label": "official_language_is"}, {"em1Text": "Belarus", "em2Text": "Russian", "label": "official_language_is"}, {"em1Text": "Belarus", "em2Text": "Belarusian", "label": "official_language_is"}]}
{"sentText": "Bulgaria (; ), officially the Republic of Bulgaria, is a country in Southeast Europe. It is situated on the eastern flank of the Balkans, and is bordered by Romania to the north, Serbia and North Macedonia to the west, Greece and Turkey to the south, and the Black Sea to the east.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Bulgaria", "em2Text": "Southeast Europe", "label": "located_in"}, {"em1Text": "Bulgaria", "em2Text": "eastern flank of the Balkans", "label": "located_in"}, {"em1Text": "Bulgaria", "em2Text": "Romania", "label": "borders"}, {"em1Text": "Bulgaria", "em2Text": "Serbia", "label": "borders"}, {"em1Text": "Bulgaria", "em2Text": "North Macedonia", "label": "borders"}, {"em1Text": "Bulgaria", "em2Text": "Greece", "label": "borders"}, {"em1Text": "Bulgaria", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Bulgaria", "em2Text": "Black Sea", "label": "borders"}]}
{"sentText": "Bulgaria covers a territory of , and is the sixteenth-largest country in Europe. Sofia is the nation's capital and largest city; other major cities are Plovdiv, Varna and Burgas.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "Sofia", "label": "is_capital_of"}, {"em1Text": "Bulgaria", "em2Text": "Sofia", "label": "is_largest_city_of"}, {"em1Text": "Bulgaria", "em2Text": "Plovdiv", "label": "is_largest_city_of"}, {"em1Text": "Bulgaria", "em2Text": "Varna", "label": "is_largest_city_of"}, {"em1Text": "Bulgaria", "em2Text": "Burgas", "label": "is_largest_city_of"}]}
{"sentText": "One of the earliest societies in the lands of modern-day Bulgaria was the Neolithic Karanovo culture, which dates back to 6,500 BC.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "Neolithic Karanovo", "label": "one_of_ethnicity"}]}
{"sentText": "Many ethnic Bulgarians were left outside the new nation's borders, which stoked irredentist sentiments that led to several conflicts with its neighbours and alliances with Germany in both world wars. In 1946, Bulgaria came under the Soviet-led Eastern Bloc and became a socialist state.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "Bulgarians", "label": "one_of_ethnicity"}, {"em1Text": "Bulgaria", "em2Text": "socialist", "label": "has_state_type"}]}
{"sentText": "Bulgaria then transitioned into a democracy and a market-based economy.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "democracy", "label": "has_state_type"}]}
{"sentText": "Since adopting a democratic constitution in 1991, Bulgaria has been a unitary parliamentary republic composed of 28 provinces, with a high degree of political, administrative, and economic centralisation.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "democratic", "label": "has_state_type"}, {"em1Text": "Bulgaria", "em2Text": "unitary parliamentary republic", "label": "has_state_type"}]}
{"sentText": "The name \"Bulgaria\" is derived from the \"Bulgars\", a tribe of Turkic origin that founded the First Bulgarian Empire.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "Bulgars", "label": "one_of_ethnicity"}]}
{"sentText": "Sunni Muslims are the second-largest religious community and constitute 10% of Bulgaria's overall religious makeup, although a majority of them are not observant and find the use of Islamic veils in schools unacceptable.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "Sunni Muslims", "label": "majority_religion_is"}, {"em1Text": "Bulgaria", "em2Text": "Islamic", "label": "majority_religion_is"}]}
{"sentText": "Bulgaria is a secular state with guaranteed religious freedom by constitution, but Orthodoxy is designated as a \"traditional\" religion.", "relationMentions": [{"em1Text": "Bulgaria", "em2Text": "Orthodoxy", "label": "majority_religion_is"}]}
{"sentText": "Belgium, officially the Kingdom of Belgium, is a country in Northwestern Europe. The country is bordered by the Netherlands to the north, Germany to the east, Luxembourg to the southeast, France to the southwest, and the North Sea to the northwest. It covers an area of and has a population of more than 11.5 million, making it the 22nd most densely populated country in the world and the 6th most densely populated country in Europe, with a density of . The capital and largest city is Brussels; other major cities are Antwerp, Ghent, Charleroi, Liege, Bruges, Namur, and Leuven.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "Kingdom", "label": "has_state_type"}, {"em1Text": "Belgium", "em2Text": "Northwestern Europe", "label": "located_in"}, {"em1Text": "Belgium", "em2Text": "Netherlands", "label": "borders"}, {"em1Text": "Belgium", "em2Text": "Germany", "label": "borders"}, {"em1Text": "Belgium", "em2Text": "Luxembourg", "label": "borders"}, {"em1Text": "Belgium", "em2Text": "France", "label": "borders"}, {"em1Text": "Belgium", "em2Text": "North Sea", "label": "borders"}, {"em1Text": "Belgium", "em2Text": "11.5 million", "label": "has_population_of"}, {"em1Text": "Belgium", "em2Text": "Brussels", "label": "is_capital_of"}, {"em1Text": "Belgium", "em2Text": "Brussels", "label": "is_largest_city_of"}, {"em1Text": "Belgium", "em2Text": "Antwerp", "label": "is_largest_city_of"}, {"em1Text": "Belgium", "em2Text": "Ghent", "label": "is_largest_city_of"}, {"em1Text": "Belgium", "em2Text": "Liege", "label": "is_largest_city_of"}, {"em1Text": "Belgium", "em2Text": "Bruges", "label": "is_largest_city_of"}]}
{"sentText": "Belgium is a sovereign state and a federal constitutional monarchy with a parliamentary system. Its institutional organization is complex and is structured on both regional and linguistic grounds. It is divided into three highly autonomous regions: the Flemish Region (Flanders) in the north, the Walloon Region (Wallonia) in the south, and the Brussels-Capital Region.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "sovereign state", "label": "has_state_type"}, {"em1Text": "Belgium", "em2Text": "federal constitutional monarchy", "label": "has_state_type"}, {"em1Text": "Belgium", "em2Text": "parliamentary system", "label": "has_state_type"}, {"em1Text": "Belgium", "em2Text": "Walloon", "label": "located_in"}, {"em1Text": "Belgium", "em2Text": "Brussels-Capital", "label": "located_in"}, {"em1Text": "Belgium", "em2Text": "Flemish", "label": "located_in"}]}
{"sentText": "Belgium has three official languages: Dutch, French and German.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "Dutch", "label": "official_language_is"}, {"em1Text": "Belgium", "em2Text": "French", "label": "official_language_is"}, {"em1Text": "Belgium", "em2Text": "German", "label": "official_language_is"}]}
{"sentText": "Belgium switched to the euro in 2002, with the first sets of euro coins being minted in 1999.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "euro", "label": "currency_is"}]}
{"sentText": "Roman Catholicism has traditionally been Belgium's majority religion; being especially strong in Flanders.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "Roman Catholicism", "label": "majority_religion_is"}]}
{"sentText": "Despite the drop in church attendance, Catholic identity nevertheless remains an important part of Belgium's culture.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "Catholic", "label": "majority_religion_is"}]}
{"sentText": "The largest group of immigrants in Belgium are Moroccans, with 400,000 people. The Turks are the third largest group, and the second largest Muslim ethnic group, numbering 220,000.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "Moroccans", "label": "one_of_ethnicity"}, {"em1Text": "Belgium", "em2Text": "Turks", "label": "one_of_ethnicity"}]}
{"sentText": "Statbel released figures of the Belgian population in relation to the origin of people in Belgium. According to the data, as of 1 January 2021, 67.3% of the Belgian population was of ethnic Belgian origin and 32.", "relationMentions": [{"em1Text": "Belgium", "em2Text": "Belgian", "label": "one_of_ethnicity"}]}
{"sentText": "Azerbaijan (, ; ), officially the Republic of Azerbaijan, is a transcontinental country located at the boundary of Eastern Europe and Western Asia. It is a part of the South Caucasus region, and is bounded by the Caspian Sea to the east, Russia (Republic of Dagestan) to the north, Georgia to the northwest, Armenia and Turkey to the west, and Iran to the south. Baku is the capital and largest city.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Republic", "label": "has_state_type"}, {"em1Text": "Azerbaijan", "em2Text": "Eastern Europe", "label": "located_in"}, {"em1Text": "Azerbaijan", "em2Text": "Western Asia", "label": "located_in"}, {"em1Text": "Azerbaijan", "em2Text": "South Caucasus region", "label": "located_in"}, {"em1Text": "Azerbaijan", "em2Text": "Caspian Sea", "label": "borders"}, {"em1Text": "Azerbaijan", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Azerbaijan", "em2Text": "Georgia", "label": "borders"}, {"em1Text": "Azerbaijan", "em2Text": "Armenia", "label": "borders"}, {"em1Text": "Azerbaijan", "em2Text": "Turkey", "label": "borders"}, {"em1Text": "Azerbaijan", "em2Text": "Iran", "label": "borders"}, {"em1Text": "Azerbaijan", "em2Text": "Baku", "label": "is_capital_of"}, {"em1Text": "Azerbaijan", "em2Text": "Baku", "label": "is_largest_city_of"}]}
{"sentText": "The Azerbaijan Democratic Republic proclaimed its independence from the Transcaucasian Democratic Federative Republic in 1918 and became the first secular democratic Muslim-majority state.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Muslim", "label": "majority_religion_is"}]}
{"sentText": "The modern Republic of Azerbaijan proclaimed its independence on 30 August 1991, shortly before the dissolution of the Soviet Union in the same year.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Republic", "label": "has_state_type"}]}
{"sentText": "Azerbaijan is a unitary semi-presidential republic.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "unitary semi-presidential republic", "label": "has_state_type"}]}
{"sentText": "Azerbaijan is also an observer state of the WTO.\nThe vast majority of the country's population (97%) is nominally Muslim, but the constitution does not declare an official religion and all major political forces in the country are secularist.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Muslim", "label": "majority_religion_is"}]}
{"sentText": "The region and seven surrounding districts are internationally recognized as part of Azerbaijan pending a solution to the status of the Nagorno-Karabakh through negotiations facilitated by the OSCE, became \"de facto\" independent with the end of the First Nagorno-Karabakh War in 1994.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Nagorno-Karabakh", "label": "located_in"}]}
{"sentText": "Many Russians and Armenians left and fled Azerbaijan as refugees during the 1990s.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Russians", "label": "one_of_ethnicity"}, {"em1Text": "Azerbaijan", "em2Text": "Armenians", "label": "one_of_ethnicity"}]}
{"sentText": "According to the 1970 census, there were 510,000 ethnic Russians and 484,000 Armenians in Azerbaijan.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Armenians", "label": "one_of_ethnicity"}, {"em1Text": "Azerbaijan", "em2Text": "Russians", "label": "one_of_ethnicity"}]}
{"sentText": "Azerbaijan is considered the most secular Muslim-majority country.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Muslim", "label": "majority_religion_is"}]}
{"sentText": "85% of the Muslims are Shia and 15% Sunni; the Republic of Azerbaijan has the second-highest proportion of Shia Muslims of any country in the world.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Muslims", "label": "majority_religion_is"}, {"em1Text": "Azerbaijan", "em2Text": "Shia", "label": "majority_religion_is"}, {"em1Text": "Azerbaijan", "em2Text": "Muslims", "label": "majority_religion_is"}, {"em1Text": "Azerbaijan", "em2Text": "Republic", "label": "has_state_type"}]}
{"sentText": "This led to the launch of a new currency in Azerbaijan, the new Azerbaijani manat, on 1 January 2006, to cement the economic reforms and erase the vestiges of an unstable economy.", "relationMentions": [{"em1Text": "Azerbaijan", "em2Text": "Azerbaijani manat", "label": "currency_is"}]}
{"sentText": "Albania remained under Ottoman rule for nearly five centuries, during which many Albanians (known as Arnauts) attained high-ranking offices in the empire, especially in the Southern Balkans and Egypt.", "relationMentions": [{"em1Text": "Albania", "em2Text": "Arnauts", "label": "one_of_ethnicity"}]}
{"sentText": "The estimates vary between 60,000 and 300,000 ethnic Greeks in Albania.", "relationMentions": [{"em1Text": "Albania", "em2Text": "Greeks", "label": "one_of_ethnicity"}]}
{"sentText": "%) Sunni Muslims, 280,921 (10.03%) Roman Catholics, 188,992 (6.75%) Eastern Orthodox, 58,628 (2.09%) Bektashi Muslims, 3,797 (0.14%) Evangelicals, 1,919 (0.07%) other Christians, 602 (0.02%) of other religions and 153,630 (5.49%) believers without denomination in Albania.", "relationMentions": [{"em1Text": "Albania", "em2Text": "Sunni Muslims", "label": "majority_religion_is"}, {"em1Text": "Albania", "em2Text": "Roman Catholics", "label": "majority_religion_is"}, {"em1Text": "Albania", "em2Text": "Eastern Orthodox", "label": "majority_religion_is"}]}
{"sentText": "Andorra is the world's 16th-smallest country by land and 11th-smallest by population. Its capital, Andorra la Vella, is the highest capital city in Europe, at an elevation of above sea level. The official language is Catalan, but Spanish, Portuguese, and French are also commonly spoken.", "relationMentions": [{"em1Text": "Andorra", "em2Text": "Catalan", "label": "official_language_is"}, {"em1Text": "Andorra", "em2Text": "Spanish", "label": "official_language_is"}, {"em1Text": "Andorra", "em2Text": "Portuguese", "label": "official_language_is"}, {"em1Text": "Andorra", "em2Text": "French", "label": "official_language_is"}]}
{"sentText": "Andorra is not a member state of the European Union, but the euro is its official currency.", "relationMentions": [{"em1Text": "Andorra", "em2Text": "euro", "label": "currency_is"}]}
{"sentText": "Believed to have been created by Charlemagne, Andorra was ruled by the count of Urgell until 988, when it was transferred to the Roman Catholic Diocese of Urgell. The present principality was formed by a charter in 1278. It is headed by two co-princes: the Bishop of Urgell in Catalonia, Spain and the President of France. Its capital and largest city is Andorra la Vella.", "relationMentions": [{"em1Text": "Andorra la Vella", "em2Text": "Andorra", "label": "is_largest_city_of"}]}
{"sentText": "Andorra, officially the Principality of Andorra, is a sovereign landlocked microstate on the Iberian Peninsula, in the eastern Pyrenees, bordered by France to the north and Spain to the south.", "relationMentions": [{"em1Text": "Andorra", "em2Text": "Iberian Peninsula", "label": "located_in"}, {"em1Text": "Andorra", "em2Text": "eastern Pyrenees", "label": "located_in"}]}
{"sentText": "(See History of the Jews in Andorra.", "relationMentions": [{"em1Text": "Andorra", "em2Text": "Jews", "label": "majority_religion_is"}]}
{"sentText": "An Armenian principality and later a kingdom Cilician Armenia was located on the coast of the Mediterranean Sea between the 11th and 14th centuries.", "relationMentions": [{"em1Text": "kingdom Cilician Armenia", "em2Text": "on the coast of the Mediterranean Sea", "label": "located_in"}]}
{"sentText": "While Armenia is geographically located in the South Caucasus, it is generally considered geopolitically European.", "relationMentions": [{"em1Text": "Armenia", "em2Text": "South Caucasus", "label": "located_in"}]}
{"sentText": "On 3 March 2022, Vahagn Khachaturyan was elected as the fifth president of Armenia in the second round of parliamentary vote.", "relationMentions": []}
{"sentText": "The main foreign languages in Armenia are Russian and English.", "relationMentions": [{"em1Text": "Armenia", "em2Text": "Russian", "label": "official_language_is"}, {"em1Text": "Armenia", "em2Text": "English", "label": "official_language_is"}]}
{"sentText": "Bucharest is the capital and the largest city in Romania, with a population of over 1.", "relationMentions": [{"em1Text": "Romania", "em2Text": "Bucharest", "label": "is_capital_of"}, {"em1Text": "Romania", "em2Text": "Bucharest", "label": "is_largest_city_of"}]}
{"sentText": "After the end of the Cold War, Romania developed closer ties with Western Europe and the United States, eventually joining NATO in 2004, and hosting the 2008 summit in Bucharest. The country applied in June 1993 for membership in the European Union and became an Associated State of the EU in 1995, an Acceding Country in 2004, and a full member on 1 January 2007.", "relationMentions": [{"em1Text": "Romania", "em2Text": "NATO", "label": "part_of"}, {"em1Text": "Romania", "em2Text": "European Union", "label": "part_of"}]}
{"sentText": "Portugal's distribution system is also now a two-way street. Instead of just delivering electricity, it draws electricity from even the smallest generators, like rooftop solar panels. The government aggressively encouraged such contributions by setting a premium price for those who buy rooftop-generated solar electricity. Demographics. The Statistics Portugal () estimates that, according to the 2021 census, the population was 10,344,802 (of which 52% was female, 48% was male).", "relationMentions": [{"em1Text": "Portugal", "em2Text": "10,344,802", "label": "has_population_of"}]}
{"sentText": "A member state of the United Nations since 1955, Portugal is also a founding member of NATO (1949), OECD (1961) and EFTA (1960); it left the last in 1986 to join the European Economic Community, which became the European Union in 1993. In 1996, Portugal co-founded the Community of Portuguese Language Countries (CPLP), also known as the Lusophone Commonwealth, an international organization and political association of Lusophone nations across four continents, where Portuguese is an official language.", "relationMentions": [{"em1Text": "Portugal", "em2Text": "Community of Portuguese Language Countries", "label": "part_of"}, {"em1Text": "Portugal", "em2Text": "Portuguese", "label": "official_language_is"}, {"em1Text": "Portugal", "em2Text": "EFTA", "label": "part_of"}, {"em1Text": "Portugal", "em2Text": "NATO", "label": "part_of"}, {"em1Text": "Portugal", "em2Text": "United Nations", "label": "part_of"}, {"em1Text": "Portugal", "em2Text": "OECD", "label": "part_of"}, {"em1Text": "Portugal", "em2Text": "European Union", "label": "part_of"}]}
{"sentText": "Poland, officially the Republic of Poland, is a country in Central Europe.", "relationMentions": [{"em1Text": "Poland", "em2Text": "Central Europe", "label": "located_in"}]}
{"sentText": "Poland has a population of over 38 million and is the fifth-most populous member state of the European Union. Warsaw is the nation's capital and largest metropolis. Other major cities include Krakow, Lodz, Wroclaw, Poznan, Gdansk, and Szczecin.", "relationMentions": [{"em1Text": "Poland", "em2Text": "38 million", "label": "has_population_of"}, {"em1Text": "Poland", "em2Text": "European Union", "label": "part_of"}, {"em1Text": "Poland", "em2Text": "Warsaw", "label": "is_capital_of"}, {"em1Text": "Poland", "em2Text": "Warsaw", "label": "is_largest_city_of"}, {"em1Text": "Poland", "em2Text": "Krakow", "label": "is_largest_city_of"}, {"em1Text": "Poland", "em2Text": "Lodz", "label": "is_largest_city_of"}, {"em1Text": "Poland", "em2Text": "Wroclaw", "label": "is_largest_city_of"}, {"em1Text": "Poland", "em2Text": "Poznan", "label": "is_largest_city_of"}, {"em1Text": "Poland", "em2Text": "Gdansk", "label": "is_largest_city_of"}, {"em1Text": "Poland", "em2Text": "Szczecin", "label": "is_largest_city_of"}]}
{"sentText": "Poland's territory extends from the Baltic Sea in the north to the Sudeten and Carpathian Mountains in the south. The country is bordered by Lithuania and Russia to the northeast, Belarus and Ukraine to the east, Slovakia and the Czech Republic to the south, and Germany to the west. Poland also shares maritime boundaries with Denmark and Sweden.", "relationMentions": [{"em1Text": "Poland", "em2Text": "Lithuania", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Belarus", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Ukraine", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Slovakia", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Czech Republic", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Germany", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Denmark", "label": "borders"}, {"em1Text": "Poland", "em2Text": "Sweden", "label": "borders"}]}
{"sentText": "Poland is a founding member state of the United Nations, as well as a member of the World Trade Organization, NATO, and the European Union (including the Schengen Area).", "relationMentions": [{"em1Text": "Poland", "em2Text": "United Nations", "label": "part_of"}, {"em1Text": "Poland", "em2Text": "World Trade Organization", "label": "part_of"}, {"em1Text": "Poland", "em2Text": "NATO", "label": "part_of"}, {"em1Text": "Poland", "em2Text": "European Union", "label": "part_of"}, {"em1Text": "Poland", "em2Text": "Schengen Area", "label": "part_of"}]}
{"sentText": "Polish is the official and predominant spoken language in Poland, and is one of the official languages of the European Union. It is also a second language in parts of neighbouring Lithuania, where it is taught in Polish-minority schools. Contemporary Poland is a linguistically homogeneous nation, with 97% of respondents declaring Polish as their mother tongue. There are currently 15 minority languages in Poland, including one recognised regional language, Kashubian, which is spoken by approximately 100,000 people on a daily basis in the northern regions of Kashubia and Pomerania.", "relationMentions": [{"em1Text": "Poland", "em2Text": "Polish", "label": "official_language_is"}, {"em1Text": "Poland", "em2Text": "Kashubian", "label": "official_language_is"}]}
{"sentText": "Norway, officially the Kingdom of Norway, is a Nordic country in Northern Europe, the mainland territory of which comprises the western and northernmost portion of the Scandinavian Peninsula.", "relationMentions": [{"em1Text": "Norway", "em2Text": "Northern Europe", "label": "part_of"}]}
{"sentText": "The capital and largest city in Norway is Oslo.", "relationMentions": [{"em1Text": "Norway", "em2Text": "Oslo", "label": "is_capital_of"}, {"em1Text": "Norway", "em2Text": "Oslo", "label": "is_largest_city_of"}]}
{"sentText": "Norway has a total area of and had a population of 5,425,270 in January 2022. The country shares a long eastern border with Sweden at a length of . It is bordered by Finland and Russia to the northeast and the Skagerrak strait to the south, on the other side of which are Denmark and the United Kingdom.", "relationMentions": [{"em1Text": "Norway", "em2Text": "5,425,270", "label": "has_population_of"}, {"em1Text": "Norway", "em2Text": "Sweden", "label": "borders"}, {"em1Text": "Norway", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Norway", "em2Text": "Finland", "label": "borders"}, {"em1Text": "Norway", "em2Text": "Denmark", "label": "borders"}, {"em1Text": "Norway", "em2Text": "the United Kingdom", "label": "borders"}]}
{"sentText": "Norway is also a founding member of the United Nations, NATO, the European Free Trade Association, the Council of Europe, the Antarctic Treaty, and the Nordic Council; a member of the European Economic Area, the WTO, and the OECD; and a part of the Schengen Area.", "relationMentions": [{"em1Text": "Norway", "em2Text": "NATO", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "European Free Trade Association", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "Council of Europe,", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "Antarctic Treaty", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "Nordic Council", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "European Economic Area", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "WTO", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "the", "label": "part_of"}, {"em1Text": "Norway", "em2Text": "Schengen Area", "label": "part_of"}]}
{"sentText": "A unitary parliamentary constitutional republic, North Macedonia is a member of the UN, NATO, the Council of Europe, the World Bank, OSCE, CEFTA, BSEC and the WTO.", "relationMentions": [{"em1Text": "North Macedonia", "em2Text": "UN", "label": "part_of"}, {"em1Text": "North Macedonia", "em2Text": "NATO", "label": "part_of"}, {"em1Text": "North Macedonia", "em2Text": "Council of Europe", "label": "part_of"}, {"em1Text": "North Macedonia", "em2Text": "the World Bank", "label": "part_of"}, {"em1Text": "North Macedonia", "em2Text": "OSCE", "label": "part_of"}, {"em1Text": "North Macedonia", "em2Text": "CEFTA", "label": "part_of"}, {"em1Text": "North Macedonia", "em2Text": "BSEC", "label": "part_of"}, {"em1Text": "North Macedonia", "em2Text": "WTO", "label": "part_of"}]}
{"sentText": "The Netherlands ( ), informally Holland, is a country located in Northwestern Europe with overseas territories in the Caribbean.", "relationMentions": [{"em1Text": "The Netherlands", "em2Text": "Northwestern Europe", "label": "located_in"}]}
{"sentText": "The four largest cities in the Netherlands are Amsterdam, Rotterdam, The Hague and Utrecht.", "relationMentions": [{"em1Text": "the Netherlands", "em2Text": "Amsterdam", "label": "is_capital_of"}, {"em1Text": "the Netherlands", "em2Text": "Amsterdam", "label": "is_largest_city_of"}, {"em1Text": "the Netherlands", "em2Text": "Rotterdam", "label": "is_largest_city_of"}, {"em1Text": "the Netherlands", "em2Text": "Utrecht", "label": "is_largest_city_of"}, {"em1Text": "the Netherlands", "em2Text": "The Hague", "label": "is_largest_city_of"}]}
{"sentText": "The Netherlands is a founding member of the European Union, Eurozone, G10, NATO, OECD, and WTO, as well as a part of the Schengen Area and the trilateral Benelux Union.", "relationMentions": [{"em1Text": "The Netherlands", "em2Text": "European Union", "label": "part_of"}, {"em1Text": "The Netherlands", "em2Text": "Eurozone", "label": "part_of"}, {"em1Text": "The Netherlands", "em2Text": "G10", "label": "part_of"}, {"em1Text": "The Netherlands", "em2Text": "NATO", "label": "part_of"}, {"em1Text": "The Netherlands", "em2Text": "OECD", "label": "part_of"}, {"em1Text": "The Netherlands", "em2Text": "WTO", "label": "part_of"}, {"em1Text": "The Netherlands", "em2Text": "the Schengen Area", "label": "part_of"}, {"em1Text": "The Netherlands", "em2Text": "trilateral Benelux Union", "label": "part_of"}]}
{"sentText": "In the Republican period, which began in 1588, the Netherlands entered a unique era of political, economic, and cultural greatness, ranked among the most powerful and influential in Europe and the world; this period is known as the Dutch Golden Age. During this time, its trading companies, the Dutch East India Company and the Dutch West India Company, established colonies and trading posts all over the world. With a population of 17.6 million people, all living within a total area of roughly --of which the land area is --the Netherlands is the 16th most densely populated country in the world and the second-most densely populated country in the European Union, with a density of .", "relationMentions": [{"em1Text": "the Netherlands", "em2Text": "17.6 million", "label": "has_population_of"}]}
{"sentText": "Montenegro is a NATO member and a member of Adriatic Charter.", "relationMentions": [{"em1Text": "Montenegro", "em2Text": "NATO", "label": "part_of"}, {"em1Text": "Montenegro", "em2Text": "Adriatic Charter", "label": "part_of"}]}
{"sentText": "Montenegro is a member of the International Commission for the Protection of the Danube River, as more than of the country's territory lie within the Danube catchment area.", "relationMentions": [{"em1Text": "Montenegro", "em2Text": "International Commission for the Protection of the Danube River", "label": "part_of"}]}
{"sentText": "Moldova ( , ; ), officially the Republic of Moldova (), is a landlocked country in Eastern Europe. It is bordered by Romania to the west and Ukraine to the north, east, and south.", "relationMentions": [{"em1Text": "Moldova", "em2Text": "Eastern Europe", "label": "located_in"}, {"em1Text": "Moldova", "em2Text": "Romania", "label": "borders"}, {"em1Text": "Moldova", "em2Text": "Ukraine", "label": "borders"}]}
{"sentText": "With an area of , Luxembourg is one of the smallest sovereign states in Europe. In 2022, it had a population of 645,397, which makes it one of the least-populous countries in Europe, albeit with the highest population growth rate; foreigners account for nearly half the population.", "relationMentions": [{"em1Text": "Luxembourg", "em2Text": "Europe", "label": "located_in"}, {"em1Text": "Luxembourg", "em2Text": "645,397", "label": "has_population_of"}]}
{"sentText": "Luxembourg is a representative democracy headed by a constitutional monarch, Grand Duke Henri, making it the world's only remaining sovereign grand duchy.", "relationMentions": []}
{"sentText": "Lithuania (; ), officially the Republic of Lithuania (), is a country in the Baltic region of Europe.", "relationMentions": [{"em1Text": "Lithuania", "em2Text": "Baltic region", "label": "located_in"}, {"em1Text": "Lithuania", "em2Text": "Europe", "label": "located_in"}]}
{"sentText": "Lithuania shares land borders with Latvia to the north, Belarus to the east and south, Poland to the south, and Russia to the southwest. It has a maritime border with Sweden to the west on the Baltic Sea.", "relationMentions": [{"em1Text": "Lithuania", "em2Text": "Latvia", "label": "borders"}, {"em1Text": "Lithuania", "em2Text": "Belarus", "label": "borders"}, {"em1Text": "Lithuania", "em2Text": "Poland", "label": "borders"}, {"em1Text": "Lithuania", "em2Text": "Russia", "label": "borders"}, {"em1Text": "Lithuania", "em2Text": "Sweden", "label": "borders"}]}
{"sentText": "The state's sovereignty was officially recognised by the Franco-Monegasque Treaty of 1861, with Monaco becoming a full United Nations voting member in 1993.", "relationMentions": [{"em1Text": "Monaco", "em2Text": "United Nations", "label": "part_of"}]}
{"sentText": "An Alpine country, Liechtenstein is mountainous, making it a winter sport destination. Liechtenstein is a member of the United Nations, the European Free Trade Association, and the Council of Europe. Although not a member of the European Union, it participates in both the Schengen Area and the European Economic Area.", "relationMentions": [{"em1Text": "Liechtenstein", "em2Text": "the European Free Trade Association", "label": "located_in"}, {"em1Text": "Liechtenstein", "em2Text": "European Union", "label": "located_in"}, {"em1Text": "Liechtenstein", "em2Text": "the United Nations", "label": "located_in"}, {"em1Text": "Liechtenstein", "em2Text": "Council of Europe", "label": "located_in"}, {"em1Text": "Liechtenstein", "em2Text": "European Economic Area", "label": "located_in"}, {"em1Text": "Liechtenstein", "em2Text": "Schengen Area", "label": "located_in"}]}
{"sentText": "Liechtenstein is bordered by Switzerland to the west and south and Austria to the east and north. It is Europe's fourth-smallest country, with an area of just over and a population of 38,749 (in 2019).", "relationMentions": [{"em1Text": "Liechtenstein", "em2Text": "38,749", "label": "has_population_of"}]}